RT-Thread/rt-thread/bsp/mb9bf618s/CMSIS/DeviceSupport/fujitsu/mb9bf61x/mb9b610s.h
typedef struct stc_adc_sctsl_field
{
  __IO  uint8_t SCTSL0     : 1;
  __IO  uint8_t SCTSL1     : 1;
  __IO  uint8_t SCTSL2     : 1;
  __IO  uint8_t SCTSL3     : 1;
} stc_adc_sctsl_field_t;

typedef struct stc_adc_adcen_field
{
  __IO  uint8_t ENBL       : 1;
  __IO  uint8_t READY      : 1;
        uint8_t RESERVED1  : 2;
  __IO  uint8_t CYCLSL0    : 1;
  __IO  uint8_t CYCLSL1    : 1;
} stc_adc_adcen_field_t;

/******************************************************************************
 * CRTRIM_MODULE
 ******************************************************************************/
/* CRTRIM_MODULE register bit fields */
typedef struct stc_crtrim_mcr_psr_field
{
  __IO  uint8_t CSR0       : 1;
  __IO  uint8_t CSR1       : 1;
} stc_crtrim_mcr_psr_field_t;

typedef struct stc_crtrim_mcr_ftrm_field
{
  __IO uint16_t TRD0       : 1;
  __IO uint16_t TRD1       : 1;
  __IO uint16_t TRD2       : 1;
  __IO uint16_t TRD3       : 1;
  __IO uint16_t TRD4       : 1;
  __IO uint16_t TRD5       : 1;
  __IO uint16_t TRD6       : 1;
  __IO uint16_t TRD7       : 1;
} stc_crtrim_mcr_ftrm_field_t;

/******************************************************************************
 * EXTI_MODULE
 ******************************************************************************/
/* EXTI_MODULE registEN bit fields */
typedef struct stc_exti_enir_field
{
  __IO uint16_t EN0        : 1;
  __IO uint16_t EN1        : 1;
  __IO uint16_t EN2        : 1;
  __IO uint16_t EN3        : 1;
  __IO uint16_t EN4        : 1;
  __IO uint16_t EN5        : 1;
  __IO uint16_t EN6        : 1;
  __IO uint16_t EN7        : 1;
  __IO uint16_t EN8        : 1;
  __IO uint16_t EN9        : 1;
  __IO uint16_t EN10       : 1;
  __IO uint16_t EN11       : 1;
  __IO uint16_t EN12       : 1;
  __IO uint16_t EN13       : 1;
  __IO uint16_t EN14       : 1;
  __IO uint16_t EN15       : 1;
  __IO uint16_t EN16       : 1;
  __IO uint16_t EN17       : 1;
  __IO uint16_t EN18       : 1;
  __IO uint16_t EN19       : 1;
  __IO uint16_t EN20       : 1;
  __IO uint16_t EN21       : 1;
  __IO uint16_t EN22       : 1;
  __IO uint16_t EN23       : 1;
  __IO uint16_t EN24       : 1;
  __IO uint16_t EN25       : 1;
  __IO uint16_t EN26       : 1;
  __IO uint16_t EN27       : 1;
  __IO uint16_t EN28       : 1;
  __IO uint16_t EN29       : 1;
  __IO uint16_t EN30       : 1;
  __IO uint16_t EN31       : 1;
} stc_exti_enir_field_t;

typedef struct stc_exti_eirr_field
{
  __IO uint16_t ER0        : 1;
  __IO uint16_t ER1        : 1;
  __IO uint16_t ER2        : 1;
  __IO uint16_t ER3        : 1;
  __IO uint16_t ER4        : 1;
  __IO uint16_t ER5        : 1;
  __IO uint16_t ER6        : 1;
  __IO uint16_t ER7        : 1;
  __IO uint16_t ER8        : 1;
  __IO uint16_t ER9        : 1;
  __IO uint16_t ER10       : 1;
  __IO uint16_t ER11       : 1;
  __IO uint16_t ER12       : 1;
  __IO uint16_t ER13       : 1;
  __IO uint16_t ER14       : 1;
  __IO uint16_t ER15       : 1;
  __IO uint16_t ER16       : 1;
  __IO uint16_t ER17       : 1;
  __IO uint16_t ER18       : 1;
  __IO uint16_t ER19       : 1;
  __IO uint16_t ER20       : 1;
  __IO uint16_t ER21       : 1;
  __IO uint16_t ER22       : 1;
  __IO uint16_t ER23       : 1;
  __IO uint16_t ER24       : 1;
  __IO uint16_t ER25       : 1;
  __IO uint16_t ER26       : 1;
  __IO uint16_t ER27       : 1;
  __IO uint16_t ER28       : 1;
  __IO uint16_t ER29       : 1;
  __IO uint16_t ER30       : 1;
  __IO uint16_t ER31       : 1;
} stc_exti_eirr_field_t;

typedef struct stc_exti_eicl_field
{
  __IO uint16_t ECL0       : 1;
  __IO uint16_t ECL1       : 1;
  __IO uint16_t ECL2       : 1;
  __IO uint16_t ECL3       : 1;
  __IO uint16_t ECL4       : 1;
  __IO uint16_t ECL5       : 1;
  __IO uint16_t ECL6       : 1;
  __IO uint16_t ECL7       : 1;
  __IO uint16_t ECL8       : 1;
  __IO uint16_t ECL9       : 1;
  __IO uint16_t ECL10      : 1;
  __IO uint16_t ECL11      : 1;
  __IO uint16_t ECL12      : 1;
  __IO uint16_t ECL13      : 1;
  __IO uint16_t ECL14      : 1;
  __IO uint16_t ECL15      : 1;
  __IO uint16_t ECL16      : 1;
  __IO uint16_t ECL17      : 1;
  __IO uint16_t ECL18      : 1;
  __IO uint16_t ECL19      : 1;
  __IO uint16_t ECL20      : 1;
  __IO uint16_t ECL21      : 1;
  __IO uint16_t ECL22      : 1;
  __IO uint16_t ECL23      : 1;
  __IO uint16_t ECL24      : 1;
  __IO uint16_t ECL25      : 1;
  __IO uint16_t ECL26      : 1;
  __IO uint16_t ECL27      : 1;
  __IO uint16_t ECL28      : 1;
  __IO uint16_t ECL29      : 1;
  __IO uint16_t ECL30      : 1;
  __IO uint16_t ECL31      : 1;
} stc_exti_eicl_field_t;

typedef struct stc_exti_elvr_field
{
  __IO uint32_t LA0        : 1;
  __IO uint32_t LB0        : 1;
  __IO uint32_t LA1        : 1;
  __IO uint32_t LB1        : 1;
  __IO uint32_t LA2        : 1;
  __IO uint32_t LB2        : 1;
  __IO uint32_t LA3        : 1;
  __IO uint32_t LB3        : 1;
  __IO uint32_t LA4        : 1;
  __IO uint32_t LB4        : 1;
  __IO uint32_t LA5        : 1;
  __IO uint32_t LB5        : 1;
  __IO uint32_t LA6        : 1;
  __IO uint32_t LB6        : 1;
  __IO uint32_t LA7        : 1;
  __IO uint32_t LB7        : 1;
  __IO uint32_t LA8        : 1;
  __IO uint32_t LB8        : 1;
  __IO uint32_t LA9        : 1;
  __IO uint32_t LB9        : 1;
  __IO uint32_t LA10       : 1;
  __IO uint32_t LB10       : 1;
  __IO uint32_t LA11       : 1;
  __IO uint32_t LB11       : 1;
  __IO uint32_t LA12       : 1;
  __IO uint32_t LB12       : 1;
  __IO uint32_t LA13       : 1;
  __IO uint32_t LB13       : 1;
  __IO uint32_t LA14       : 1;
  __IO uint32_t LB14       : 1;
  __IO uint32_t LA15       : 1;
  __IO uint32_t LB15       : 1;
} stc_exti_elvr_field_t;

typedef struct stc_exti_elvr1_field
{
  __IO uint32_t LA16       : 1;
  __IO uint32_t LB16       : 1;
  __IO uint32_t LA17       : 1;
  __IO uint32_t LB17       : 1;
  __IO uint32_t LA18       : 1;
  __IO uint32_t LB18       : 1;
  __IO uint32_t LA19       : 1;
  __IO uint32_t LB19       : 1;
  __IO uint32_t LA20       : 1;
  __IO uint32_t LB20       : 1;
  __IO uint32_t LA21       : 1;
  __IO uint32_t LB21       : 1;
  __IO uint32_t LA22       : 1;
  __IO uint32_t LB22       : 1;
  __IO uint32_t LA23       : 1;
  __IO uint32_t LB23       : 1;
  __IO uint32_t LA24       : 1;
  __IO uint32_t LB24       : 1;
  __IO uint32_t LA25       : 1;
  __IO uint32_t LB25       : 1;
  __IO uint32_t LA26       : 1;
  __IO uint32_t LB26       : 1;
  __IO uint32_t LA27       : 1;
  __IO uint32_t LB27       : 1;
  __IO uint32_t LA28       : 1;
  __IO uint32_t LB28       : 1;
  __IO uint32_t LA29       : 1;
  __IO uint32_t LB29       : 1;
  __IO uint32_t LA30       : 1;
  __IO uint32_t LB30       : 1;
  __IO uint32_t LA31       : 1;
  __IO uint32_t LB31       : 1;
} stc_exti_elvr1_field_t;

