RT-Thread/rt-thread/bsp/mb9bf618s/CMSIS/DeviceSupport/fujitsu/mb9bf61x/mb9b610s.h
typedef struct stc_ethernet_mac_mar27h_field
{
  __IO uint32_t A32        : 1;
  __IO uint32_t A33        : 1;
  __IO uint32_t A34        : 1;
  __IO uint32_t A35        : 1;
  __IO uint32_t A36        : 1;
  __IO uint32_t A37        : 1;
  __IO uint32_t A38        : 1;
  __IO uint32_t A39        : 1;
  __IO uint32_t A40        : 1;
  __IO uint32_t A41        : 1;
  __IO uint32_t A42        : 1;
  __IO uint32_t A43        : 1;
  __IO uint32_t A44        : 1;
  __IO uint32_t A45        : 1;
  __IO uint32_t A46        : 1;
  __IO uint32_t A47        : 1;
       uint32_t RESERVED1  : 8;
  __IO uint32_t MBC0       : 1;
  __IO uint32_t MBC1       : 1;
  __IO uint32_t MBC2       : 1;
  __IO uint32_t MBC3       : 1;
  __IO uint32_t MBC4       : 1;
  __IO uint32_t MBC5       : 1;
  __IO uint32_t SA         : 1;
  __IO uint32_t AE         : 1;
} stc_ethernet_mac_mar27h_field_t;

typedef struct stc_ethernet_mac_mar27l_field
{
  __IO uint32_t A0         : 1;
  __IO uint32_t A1         : 1;
  __IO uint32_t A2         : 1;
  __IO uint32_t A3         : 1;
  __IO uint32_t A4         : 1;
  __IO uint32_t A5         : 1;
  __IO uint32_t A6         : 1;
  __IO uint32_t A7         : 1;
  __IO uint32_t A8         : 1;
  __IO uint32_t A9         : 1;
  __IO uint32_t A10        : 1;
  __IO uint32_t A11        : 1;
  __IO uint32_t A12        : 1;
  __IO uint32_t A13        : 1;
  __IO uint32_t A14        : 1;
  __IO uint32_t A15        : 1;
  __IO uint32_t A16        : 1;
  __IO uint32_t A17        : 1;
  __IO uint32_t A18        : 1;
  __IO uint32_t A19        : 1;
  __IO uint32_t A20        : 1;
  __IO uint32_t A21        : 1;
  __IO uint32_t A22        : 1;
  __IO uint32_t A23        : 1;
  __IO uint32_t A24        : 1;
  __IO uint32_t A25        : 1;
  __IO uint32_t A26        : 1;
  __IO uint32_t A27        : 1;
  __IO uint32_t A28        : 1;
  __IO uint32_t A29        : 1;
  __IO uint32_t A30        : 1;
  __IO uint32_t A31        : 1;
} stc_ethernet_mac_mar27l_field_t;

typedef struct stc_ethernet_mac_mar28h_field
{
  __IO uint32_t A32        : 1;
  __IO uint32_t A33        : 1;
  __IO uint32_t A34        : 1;
  __IO uint32_t A35        : 1;
  __IO uint32_t A36        : 1;
  __IO uint32_t A37        : 1;
  __IO uint32_t A38        : 1;
  __IO uint32_t A39        : 1;
  __IO uint32_t A40        : 1;
  __IO uint32_t A41        : 1;
  __IO uint32_t A42        : 1;
  __IO uint32_t A43        : 1;
  __IO uint32_t A44        : 1;
  __IO uint32_t A45        : 1;
  __IO uint32_t A46        : 1;
  __IO uint32_t A47        : 1;
       uint32_t RESERVED1  : 8;
  __IO uint32_t MBC0       : 1;
  __IO uint32_t MBC1       : 1;
  __IO uint32_t MBC2       : 1;
  __IO uint32_t MBC3       : 1;
  __IO uint32_t MBC4       : 1;
  __IO uint32_t MBC5       : 1;
  __IO uint32_t SA         : 1;
  __IO uint32_t AE         : 1;
} stc_ethernet_mac_mar28h_field_t;

typedef struct stc_ethernet_mac_mar28l_field
{
  __IO uint32_t A0         : 1;
  __IO uint32_t A1         : 1;
  __IO uint32_t A2         : 1;
  __IO uint32_t A3         : 1;
  __IO uint32_t A4         : 1;
  __IO uint32_t A5         : 1;
  __IO uint32_t A6         : 1;
  __IO uint32_t A7         : 1;
  __IO uint32_t A8         : 1;
  __IO uint32_t A9         : 1;
  __IO uint32_t A10        : 1;
  __IO uint32_t A11        : 1;
  __IO uint32_t A12        : 1;
  __IO uint32_t A13        : 1;
  __IO uint32_t A14        : 1;
  __IO uint32_t A15        : 1;
  __IO uint32_t A16        : 1;
  __IO uint32_t A17        : 1;
  __IO uint32_t A18        : 1;
  __IO uint32_t A19        : 1;
  __IO uint32_t A20        : 1;
  __IO uint32_t A21        : 1;
  __IO uint32_t A22        : 1;
  __IO uint32_t A23        : 1;
  __IO uint32_t A24        : 1;
  __IO uint32_t A25        : 1;
  __IO uint32_t A26        : 1;
  __IO uint32_t A27        : 1;
  __IO uint32_t A28        : 1;
  __IO uint32_t A29        : 1;
  __IO uint32_t A30        : 1;
  __IO uint32_t A31        : 1;
} stc_ethernet_mac_mar28l_field_t;

typedef struct stc_ethernet_mac_mar29h_field
{
  __IO uint32_t A32        : 1;
  __IO uint32_t A33        : 1;
  __IO uint32_t A34        : 1;
  __IO uint32_t A35        : 1;
  __IO uint32_t A36        : 1;
  __IO uint32_t A37        : 1;
  __IO uint32_t A38        : 1;
  __IO uint32_t A39        : 1;
  __IO uint32_t A40        : 1;
  __IO uint32_t A41        : 1;
  __IO uint32_t A42        : 1;
  __IO uint32_t A43        : 1;
  __IO uint32_t A44        : 1;
  __IO uint32_t A45        : 1;
  __IO uint32_t A46        : 1;
  __IO uint32_t A47        : 1;
       uint32_t RESERVED1  : 8;
  __IO uint32_t MBC0       : 1;
  __IO uint32_t MBC1       : 1;
  __IO uint32_t MBC2       : 1;
  __IO uint32_t MBC3       : 1;
  __IO uint32_t MBC4       : 1;
  __IO uint32_t MBC5       : 1;
  __IO uint32_t SA         : 1;
  __IO uint32_t AE         : 1;
} stc_ethernet_mac_mar29h_field_t;

typedef struct stc_ethernet_mac_mar29l_field
{
  __IO uint32_t A0         : 1;
  __IO uint32_t A1         : 1;
  __IO uint32_t A2         : 1;
  __IO uint32_t A3         : 1;
  __IO uint32_t A4         : 1;
  __IO uint32_t A5         : 1;
  __IO uint32_t A6         : 1;
  __IO uint32_t A7         : 1;
  __IO uint32_t A8         : 1;
  __IO uint32_t A9         : 1;
  __IO uint32_t A10        : 1;
  __IO uint32_t A11        : 1;
  __IO uint32_t A12        : 1;
  __IO uint32_t A13        : 1;
  __IO uint32_t A14        : 1;
  __IO uint32_t A15        : 1;
  __IO uint32_t A16        : 1;
  __IO uint32_t A17        : 1;
  __IO uint32_t A18        : 1;
  __IO uint32_t A19        : 1;
  __IO uint32_t A20        : 1;
  __IO uint32_t A21        : 1;
  __IO uint32_t A22        : 1;
  __IO uint32_t A23        : 1;
  __IO uint32_t A24        : 1;
  __IO uint32_t A25        : 1;
  __IO uint32_t A26        : 1;
  __IO uint32_t A27        : 1;
  __IO uint32_t A28        : 1;
  __IO uint32_t A29        : 1;
  __IO uint32_t A30        : 1;
  __IO uint32_t A31        : 1;
} stc_ethernet_mac_mar29l_field_t;

typedef struct stc_ethernet_mac_mar30h_field
{
  __IO uint32_t A32        : 1;
  __IO uint32_t A33        : 1;
  __IO uint32_t A34        : 1;
  __IO uint32_t A35        : 1;
  __IO uint32_t A36        : 1;
  __IO uint32_t A37        : 1;
  __IO uint32_t A38        : 1;
  __IO uint32_t A39        : 1;
  __IO uint32_t A40        : 1;
  __IO uint32_t A41        : 1;
  __IO uint32_t A42        : 1;
  __IO uint32_t A43        : 1;
  __IO uint32_t A44        : 1;
  __IO uint32_t A45        : 1;
  __IO uint32_t A46        : 1;
  __IO uint32_t A47        : 1;
       uint32_t RESERVED1  : 8;
  __IO uint32_t MBC0       : 1;
  __IO uint32_t MBC1       : 1;
  __IO uint32_t MBC2       : 1;
  __IO uint32_t MBC3       : 1;
  __IO uint32_t MBC4       : 1;
  __IO uint32_t MBC5       : 1;
  __IO uint32_t SA         : 1;
  __IO uint32_t AE         : 1;
} stc_ethernet_mac_mar30h_field_t;

typedef struct stc_ethernet_mac_mar30l_field
{
  __IO uint32_t A0         : 1;
  __IO uint32_t A1         : 1;
  __IO uint32_t A2         : 1;
  __IO uint32_t A3         : 1;
  __IO uint32_t A4         : 1;
  __IO uint32_t A5         : 1;
  __IO uint32_t A6         : 1;
  __IO uint32_t A7         : 1;
  __IO uint32_t A8         : 1;
  __IO uint32_t A9         : 1;
  __IO uint32_t A10        : 1;
  __IO uint32_t A11        : 1;
  __IO uint32_t A12        : 1;
  __IO uint32_t A13        : 1;
  __IO uint32_t A14        : 1;
  __IO uint32_t A15        : 1;
  __IO uint32_t A16        : 1;
  __IO uint32_t A17        : 1;
  __IO uint32_t A18        : 1;
  __IO uint32_t A19        : 1;
  __IO uint32_t A20        : 1;
  __IO uint32_t A21        : 1;
  __IO uint32_t A22        : 1;
  __IO uint32_t A23        : 1;
  __IO uint32_t A24        : 1;
  __IO uint32_t A25        : 1;
  __IO uint32_t A26        : 1;
  __IO uint32_t A27        : 1;
  __IO uint32_t A28        : 1;
  __IO uint32_t A29        : 1;
  __IO uint32_t A30        : 1;
  __IO uint32_t A31        : 1;
} stc_ethernet_mac_mar30l_field_t;

