RT-Thread/rt-thread/bsp/mb9bf618s/CMSIS/DeviceSupport/fujitsu/mb9bf61x/mb9b610s.h
/* Multifunction Timer unit 2 Waveform Generator and Noise Canceler registers */
#define bFM3_MFT2_WFG_WFSA10_DCK0              *((volatile unsigned int*)(0x42441180UL))
#define bFM3_MFT2_WFG_WFSA10_DCK1              *((volatile unsigned int*)(0x42441184UL))
#define bFM3_MFT2_WFG_WFSA10_DCK2              *((volatile unsigned int*)(0x42441188UL))
#define bFM3_MFT2_WFG_WFSA10_TMD0              *((volatile unsigned int*)(0x4244118CUL))
#define bFM3_MFT2_WFG_WFSA10_TMD1              *((volatile unsigned int*)(0x42441190UL))
#define bFM3_MFT2_WFG_WFSA10_TMD2              *((volatile unsigned int*)(0x42441194UL))
#define bFM3_MFT2_WFG_WFSA10_GTEN0             *((volatile unsigned int*)(0x42441198UL))
#define bFM3_MFT2_WFG_WFSA10_GTEN1             *((volatile unsigned int*)(0x4244119CUL))
#define bFM3_MFT2_WFG_WFSA10_PSEL0             *((volatile unsigned int*)(0x424411A0UL))
#define bFM3_MFT2_WFG_WFSA10_PSEL1             *((volatile unsigned int*)(0x424411A4UL))
#define bFM3_MFT2_WFG_WFSA10_PGEN0             *((volatile unsigned int*)(0x424411A8UL))
#define bFM3_MFT2_WFG_WFSA10_PGEN1             *((volatile unsigned int*)(0x424411ACUL))
#define bFM3_MFT2_WFG_WFSA10_DMOD              *((volatile unsigned int*)(0x424411B0UL))
#define bFM3_MFT2_WFG_WFSA32_DCK0              *((volatile unsigned int*)(0x42441200UL))
#define bFM3_MFT2_WFG_WFSA32_DCK1              *((volatile unsigned int*)(0x42441204UL))
#define bFM3_MFT2_WFG_WFSA32_DCK2              *((volatile unsigned int*)(0x42441208UL))
#define bFM3_MFT2_WFG_WFSA32_TMD0              *((volatile unsigned int*)(0x4244120CUL))
#define bFM3_MFT2_WFG_WFSA32_TMD1              *((volatile unsigned int*)(0x42441210UL))
#define bFM3_MFT2_WFG_WFSA32_TMD2              *((volatile unsigned int*)(0x42441214UL))
#define bFM3_MFT2_WFG_WFSA32_GTEN0             *((volatile unsigned int*)(0x42441218UL))
#define bFM3_MFT2_WFG_WFSA32_GTEN1             *((volatile unsigned int*)(0x4244121CUL))
#define bFM3_MFT2_WFG_WFSA32_PSEL0             *((volatile unsigned int*)(0x42441220UL))
#define bFM3_MFT2_WFG_WFSA32_PSEL1             *((volatile unsigned int*)(0x42441224UL))
#define bFM3_MFT2_WFG_WFSA32_PGEN0             *((volatile unsigned int*)(0x42441228UL))
#define bFM3_MFT2_WFG_WFSA32_PGEN1             *((volatile unsigned int*)(0x4244122CUL))
#define bFM3_MFT2_WFG_WFSA32_DMOD              *((volatile unsigned int*)(0x42441230UL))
#define bFM3_MFT2_WFG_WFSA54_DCK0              *((volatile unsigned int*)(0x42441280UL))
#define bFM3_MFT2_WFG_WFSA54_DCK1              *((volatile unsigned int*)(0x42441284UL))
#define bFM3_MFT2_WFG_WFSA54_DCK2              *((volatile unsigned int*)(0x42441288UL))
#define bFM3_MFT2_WFG_WFSA54_TMD0              *((volatile unsigned int*)(0x4244128CUL))
#define bFM3_MFT2_WFG_WFSA54_TMD1              *((volatile unsigned int*)(0x42441290UL))
#define bFM3_MFT2_WFG_WFSA54_TMD2              *((volatile unsigned int*)(0x42441294UL))
#define bFM3_MFT2_WFG_WFSA54_GTEN0             *((volatile unsigned int*)(0x42441298UL))
#define bFM3_MFT2_WFG_WFSA54_GTEN1             *((volatile unsigned int*)(0x4244129CUL))
#define bFM3_MFT2_WFG_WFSA54_PSEL0             *((volatile unsigned int*)(0x424412A0UL))
#define bFM3_MFT2_WFG_WFSA54_PSEL1             *((volatile unsigned int*)(0x424412A4UL))
#define bFM3_MFT2_WFG_WFSA54_PGEN0             *((volatile unsigned int*)(0x424412A8UL))
#define bFM3_MFT2_WFG_WFSA54_PGEN1             *((volatile unsigned int*)(0x424412ACUL))
#define bFM3_MFT2_WFG_WFSA54_DMOD              *((volatile unsigned int*)(0x424412B0UL))
#define bFM3_MFT2_WFG_WFIR_DTIF                *((volatile unsigned int*)(0x42441300UL))
#define bFM3_MFT2_WFG_WFIR_DTIC                *((volatile unsigned int*)(0x42441304UL))
#define bFM3_MFT2_WFG_WFIR_TMIF10              *((volatile unsigned int*)(0x42441310UL))
#define bFM3_MFT2_WFG_WFIR_TMIC10              *((volatile unsigned int*)(0x42441314UL))
#define bFM3_MFT2_WFG_WFIR_TMIE10              *((volatile unsigned int*)(0x42441318UL))
#define bFM3_MFT2_WFG_WFIR_TMIS10              *((volatile unsigned int*)(0x4244131CUL))
#define bFM3_MFT2_WFG_WFIR_TMIF32              *((volatile unsigned int*)(0x42441320UL))
#define bFM3_MFT2_WFG_WFIR_TMIC32              *((volatile unsigned int*)(0x42441324UL))
#define bFM3_MFT2_WFG_WFIR_TMIE32              *((volatile unsigned int*)(0x42441328UL))
#define bFM3_MFT2_WFG_WFIR_TMIS32              *((volatile unsigned int*)(0x4244132CUL))
#define bFM3_MFT2_WFG_WFIR_TMIF54              *((volatile unsigned int*)(0x42441330UL))
#define bFM3_MFT2_WFG_WFIR_TMIC54              *((volatile unsigned int*)(0x42441334UL))
#define bFM3_MFT2_WFG_WFIR_TMIE54              *((volatile unsigned int*)(0x42441338UL))
#define bFM3_MFT2_WFG_WFIR_TMIS54              *((volatile unsigned int*)(0x4244133CUL))
#define bFM3_MFT2_WFG_NZCL_DTIE                *((volatile unsigned int*)(0x42441380UL))
#define bFM3_MFT2_WFG_NZCL_NWS0                *((volatile unsigned int*)(0x42441384UL))
#define bFM3_MFT2_WFG_NZCL_NWS1                *((volatile unsigned int*)(0x42441388UL))
#define bFM3_MFT2_WFG_NZCL_NWS2                *((volatile unsigned int*)(0x4244138CUL))
#define bFM3_MFT2_WFG_NZCL_SDTI                *((volatile unsigned int*)(0x42441390UL))

/* Multifunction Timer unit 2 Input Capture Unit registers */
#define bFM3_MFT2_ICU_ICFS10_FSI00             *((volatile unsigned int*)(0x42440C00UL))
#define bFM3_MFT2_ICU_ICFS10_FSI01             *((volatile unsigned int*)(0x42440C04UL))
#define bFM3_MFT2_ICU_ICFS10_FSI02             *((volatile unsigned int*)(0x42440C08UL))
#define bFM3_MFT2_ICU_ICFS10_FSI03             *((volatile unsigned int*)(0x42440C0CUL))
#define bFM3_MFT2_ICU_ICFS10_FSI10             *((volatile unsigned int*)(0x42440C10UL))
#define bFM3_MFT2_ICU_ICFS10_FSI11             *((volatile unsigned int*)(0x42440C14UL))
#define bFM3_MFT2_ICU_ICFS10_FSI12             *((volatile unsigned int*)(0x42440C18UL))
#define bFM3_MFT2_ICU_ICFS10_FSI13             *((volatile unsigned int*)(0x42440C1CUL))
#define bFM3_MFT2_ICU_ICFS32_FSI20             *((volatile unsigned int*)(0x42440C20UL))
#define bFM3_MFT2_ICU_ICFS32_FSI21             *((volatile unsigned int*)(0x42440C24UL))
#define bFM3_MFT2_ICU_ICFS32_FSI22             *((volatile unsigned int*)(0x42440C28UL))
#define bFM3_MFT2_ICU_ICFS32_FSI23             *((volatile unsigned int*)(0x42440C2CUL))
#define bFM3_MFT2_ICU_ICFS32_FSI30             *((volatile unsigned int*)(0x42440C30UL))
#define bFM3_MFT2_ICU_ICFS32_FSI31             *((volatile unsigned int*)(0x42440C34UL))
#define bFM3_MFT2_ICU_ICFS32_FSI32             *((volatile unsigned int*)(0x42440C38UL))
#define bFM3_MFT2_ICU_ICFS32_FSI33             *((volatile unsigned int*)(0x42440C3CUL))
#define bFM3_MFT2_ICU_ICSA10_EG00              *((volatile unsigned int*)(0x42440F00UL))
#define bFM3_MFT2_ICU_ICSA10_EG01              *((volatile unsigned int*)(0x42440F04UL))
#define bFM3_MFT2_ICU_ICSA10_EG10              *((volatile unsigned int*)(0x42440F08UL))
#define bFM3_MFT2_ICU_ICSA10_EG11              *((volatile unsigned int*)(0x42440F0CUL))
#define bFM3_MFT2_ICU_ICSA10_ICE0              *((volatile unsigned int*)(0x42440F10UL))
#define bFM3_MFT2_ICU_ICSA10_ICE1              *((volatile unsigned int*)(0x42440F14UL))
#define bFM3_MFT2_ICU_ICSA10_ICP0              *((volatile unsigned int*)(0x42440F18UL))
#define bFM3_MFT2_ICU_ICSA10_ICP1              *((volatile unsigned int*)(0x42440F1CUL))
#define bFM3_MFT2_ICU_ICSB10_IEI0              *((volatile unsigned int*)(0x42440F20UL))
#define bFM3_MFT2_ICU_ICSB10_IEI1              *((volatile unsigned int*)(0x42440F24UL))
#define bFM3_MFT2_ICU_ICSA32_EG20              *((volatile unsigned int*)(0x42440F80UL))
#define bFM3_MFT2_ICU_ICSA32_EG21              *((volatile unsigned int*)(0x42440F84UL))
#define bFM3_MFT2_ICU_ICSA32_EG30              *((volatile unsigned int*)(0x42440F88UL))
#define bFM3_MFT2_ICU_ICSA32_EG31              *((volatile unsigned int*)(0x42440F8CUL))
#define bFM3_MFT2_ICU_ICSA32_ICE2              *((volatile unsigned int*)(0x42440F90UL))
#define bFM3_MFT2_ICU_ICSA32_ICE3              *((volatile unsigned int*)(0x42440F94UL))
#define bFM3_MFT2_ICU_ICSA32_ICP2              *((volatile unsigned int*)(0x42440F98UL))
#define bFM3_MFT2_ICU_ICSA32_ICP3              *((volatile unsigned int*)(0x42440F9CUL))
#define bFM3_MFT2_ICU_ICSB32_IEI2              *((volatile unsigned int*)(0x42440FA0UL))
#define bFM3_MFT2_ICU_ICSB32_IEI3              *((volatile unsigned int*)(0x42440FA4UL))

