RT-Thread/rt-thread/bsp/mb9bf618s/CMSIS/DeviceSupport/fujitsu/mb9bf61x/mb9b610s.h
#define bFM3_GPIO_PCRC_PA                      *((volatile unsigned int*)(0x42662628UL))
#define bFM3_GPIO_PCRC_PB                      *((volatile unsigned int*)(0x4266262CUL))
#define bFM3_GPIO_PCRC_PC                      *((volatile unsigned int*)(0x42662630UL))
#define bFM3_GPIO_PCRC_PD                      *((volatile unsigned int*)(0x42662634UL))
#define bFM3_GPIO_PCRC_PE                      *((volatile unsigned int*)(0x42662638UL))
#define bFM3_GPIO_PCRC_PF                      *((volatile unsigned int*)(0x4266263CUL))
#define bFM3_GPIO_PCRD_P0                      *((volatile unsigned int*)(0x42662680UL))
#define bFM3_GPIO_PCRD_P1                      *((volatile unsigned int*)(0x42662684UL))
#define bFM3_GPIO_PCRD_P2                      *((volatile unsigned int*)(0x42662688UL))
#define bFM3_GPIO_PCRD_P3                      *((volatile unsigned int*)(0x4266268CUL))
#define bFM3_GPIO_PCRE_P2                      *((volatile unsigned int*)(0x42662708UL))
#define bFM3_GPIO_PCRE_P3                      *((volatile unsigned int*)(0x4266270CUL))
#define bFM3_GPIO_DDR0_P0                      *((volatile unsigned int*)(0x42664000UL))
#define bFM3_GPIO_DDR0_P1                      *((volatile unsigned int*)(0x42664004UL))
#define bFM3_GPIO_DDR0_P2                      *((volatile unsigned int*)(0x42664008UL))
#define bFM3_GPIO_DDR0_P3                      *((volatile unsigned int*)(0x4266400CUL))
#define bFM3_GPIO_DDR0_P4                      *((volatile unsigned int*)(0x42664010UL))
#define bFM3_GPIO_DDR0_P5                      *((volatile unsigned int*)(0x42664014UL))
#define bFM3_GPIO_DDR0_P6                      *((volatile unsigned int*)(0x42664018UL))
#define bFM3_GPIO_DDR0_P7                      *((volatile unsigned int*)(0x4266401CUL))
#define bFM3_GPIO_DDR0_P8                      *((volatile unsigned int*)(0x42664020UL))
#define bFM3_GPIO_DDR0_P9                      *((volatile unsigned int*)(0x42664024UL))
#define bFM3_GPIO_DDR1_P0                      *((volatile unsigned int*)(0x42664080UL))
#define bFM3_GPIO_DDR1_P1                      *((volatile unsigned int*)(0x42664084UL))
#define bFM3_GPIO_DDR1_P2                      *((volatile unsigned int*)(0x42664088UL))
#define bFM3_GPIO_DDR1_P3                      *((volatile unsigned int*)(0x4266408CUL))
#define bFM3_GPIO_DDR1_P4                      *((volatile unsigned int*)(0x42664090UL))
#define bFM3_GPIO_DDR1_P5                      *((volatile unsigned int*)(0x42664094UL))
#define bFM3_GPIO_DDR1_P6                      *((volatile unsigned int*)(0x42664098UL))
#define bFM3_GPIO_DDR1_P7                      *((volatile unsigned int*)(0x4266409CUL))
#define bFM3_GPIO_DDR1_P8                      *((volatile unsigned int*)(0x426640A0UL))
#define bFM3_GPIO_DDR1_P9                      *((volatile unsigned int*)(0x426640A4UL))
#define bFM3_GPIO_DDR1_PA                      *((volatile unsigned int*)(0x426640A8UL))
#define bFM3_GPIO_DDR1_PB                      *((volatile unsigned int*)(0x426640ACUL))
#define bFM3_GPIO_DDR1_PC                      *((volatile unsigned int*)(0x426640B0UL))
#define bFM3_GPIO_DDR1_PD                      *((volatile unsigned int*)(0x426640B4UL))
#define bFM3_GPIO_DDR1_PE                      *((volatile unsigned int*)(0x426640B8UL))
#define bFM3_GPIO_DDR1_PF                      *((volatile unsigned int*)(0x426640BCUL))
#define bFM3_GPIO_DDR2_P0                      *((volatile unsigned int*)(0x42664100UL))
#define bFM3_GPIO_DDR2_P1                      *((volatile unsigned int*)(0x42664104UL))
#define bFM3_GPIO_DDR2_P2                      *((volatile unsigned int*)(0x42664108UL))
#define bFM3_GPIO_DDR2_P3                      *((volatile unsigned int*)(0x4266410CUL))
#define bFM3_GPIO_DDR2_P4                      *((volatile unsigned int*)(0x42664110UL))
#define bFM3_GPIO_DDR2_P5                      *((volatile unsigned int*)(0x42664114UL))
#define bFM3_GPIO_DDR2_P6                      *((volatile unsigned int*)(0x42664118UL))
#define bFM3_GPIO_DDR2_P7                      *((volatile unsigned int*)(0x4266411CUL))
#define bFM3_GPIO_DDR2_P8                      *((volatile unsigned int*)(0x42664120UL))
#define bFM3_GPIO_DDR2_P9                      *((volatile unsigned int*)(0x42664124UL))
#define bFM3_GPIO_DDR3_P6                      *((volatile unsigned int*)(0x42664198UL))
#define bFM3_GPIO_DDR3_P7                      *((volatile unsigned int*)(0x4266419CUL))
#define bFM3_GPIO_DDR3_P8                      *((volatile unsigned int*)(0x426641A0UL))
#define bFM3_GPIO_DDR3_P9                      *((volatile unsigned int*)(0x426641A4UL))
#define bFM3_GPIO_DDR3_PA                      *((volatile unsigned int*)(0x426641A8UL))
#define bFM3_GPIO_DDR3_PB                      *((volatile unsigned int*)(0x426641ACUL))
#define bFM3_GPIO_DDR3_PC                      *((volatile unsigned int*)(0x426641B0UL))
#define bFM3_GPIO_DDR3_PD                      *((volatile unsigned int*)(0x426641B4UL))
#define bFM3_GPIO_DDR3_PE                      *((volatile unsigned int*)(0x426641B8UL))
#define bFM3_GPIO_DDR3_PF                      *((volatile unsigned int*)(0x426641BCUL))
#define bFM3_GPIO_DDR4_P0                      *((volatile unsigned int*)(0x42664200UL))
#define bFM3_GPIO_DDR4_P1                      *((volatile unsigned int*)(0x42664204UL))
#define bFM3_GPIO_DDR4_P2                      *((volatile unsigned int*)(0x42664208UL))
#define bFM3_GPIO_DDR4_P3                      *((volatile unsigned int*)(0x4266420CUL))
#define bFM3_GPIO_DDR4_P4                      *((volatile unsigned int*)(0x42664210UL))
#define bFM3_GPIO_DDR4_P5                      *((volatile unsigned int*)(0x42664214UL))
#define bFM3_GPIO_DDR4_P6                      *((volatile unsigned int*)(0x42664218UL))
#define bFM3_GPIO_DDR4_P7                      *((volatile unsigned int*)(0x4266421CUL))
#define bFM3_GPIO_DDR4_P8                      *((volatile unsigned int*)(0x42664220UL))
#define bFM3_GPIO_DDR4_P9                      *((volatile unsigned int*)(0x42664224UL))
#define bFM3_GPIO_DDR4_PA                      *((volatile unsigned int*)(0x42664228UL))
#define bFM3_GPIO_DDR4_PB                      *((volatile unsigned int*)(0x4266422CUL))
#define bFM3_GPIO_DDR4_PC                      *((volatile unsigned int*)(0x42664230UL))
#define bFM3_GPIO_DDR4_PD                      *((volatile unsigned int*)(0x42664234UL))
#define bFM3_GPIO_DDR4_PE                      *((volatile unsigned int*)(0x42664238UL))
#define bFM3_GPIO_DDR5_P0                      *((volatile unsigned int*)(0x42664280UL))
#define bFM3_GPIO_DDR5_P1                      *((volatile unsigned int*)(0x42664284UL))
#define bFM3_GPIO_DDR5_P2                      *((volatile unsigned int*)(0x42664288UL))
#define bFM3_GPIO_DDR5_P3                      *((volatile unsigned int*)(0x4266428CUL))
#define bFM3_GPIO_DDR5_P4                      *((volatile unsigned int*)(0x42664290UL))
#define bFM3_GPIO_DDR5_P5                      *((volatile unsigned int*)(0x42664294UL))
#define bFM3_GPIO_DDR5_P6                      *((volatile unsigned int*)(0x42664298UL))
#define bFM3_GPIO_DDR5_P7                      *((volatile unsigned int*)(0x4266429CUL))
#define bFM3_GPIO_DDR5_P8                      *((volatile unsigned int*)(0x426642A0UL))
#define bFM3_GPIO_DDR5_P9                      *((volatile unsigned int*)(0x426642A4UL))
#define bFM3_GPIO_DDR5_PA                      *((volatile unsigned int*)(0x426642A8UL))
#define bFM3_GPIO_DDR5_PB                      *((volatile unsigned int*)(0x426642ACUL))
#define bFM3_GPIO_DDR6_P0                      *((volatile unsigned int*)(0x42664300UL))
#define bFM3_GPIO_DDR6_P1                      *((volatile unsigned int*)(0x42664304UL))
#define bFM3_GPIO_DDR6_P2                      *((volatile unsigned int*)(0x42664308UL))
#define bFM3_GPIO_DDR7_P0                      *((volatile unsigned int*)(0x42664380UL))
#define bFM3_GPIO_DDR7_P1                      *((volatile unsigned int*)(0x42664384UL))
#define bFM3_GPIO_DDR7_P2                      *((volatile unsigned int*)(0x42664388UL))
#define bFM3_GPIO_DDR7_P3                      *((volatile unsigned int*)(0x4266438CUL))
#define bFM3_GPIO_DDR7_P4                      *((volatile unsigned int*)(0x42664390UL))
#define bFM3_GPIO_DDR7_P5                      *((volatile unsigned int*)(0x42664394UL))
#define bFM3_GPIO_DDR7_P6                      *((volatile unsigned int*)(0x42664398UL))
#define bFM3_GPIO_DDR7_P7                      *((volatile unsigned int*)(0x4266439CUL))
#define bFM3_GPIO_DDR7_P8                      *((volatile unsigned int*)(0x426643A0UL))
#define bFM3_GPIO_DDR7_P9                      *((volatile unsigned int*)(0x426643A4UL))
#define bFM3_GPIO_DDR7_PA                      *((volatile unsigned int*)(0x426643A8UL))
#define bFM3_GPIO_DDR8_P0                      *((volatile unsigned int*)(0x42664400UL))
#define bFM3_GPIO_DDR8_P1                      *((volatile unsigned int*)(0x42664404UL))
#define bFM3_GPIO_DDR8_P2                      *((volatile unsigned int*)(0x42664408UL))
#define bFM3_GPIO_DDR8_P3                      *((volatile unsigned int*)(0x4266440CUL))
#define bFM3_GPIO_DDRA_P0                      *((volatile unsigned int*)(0x42664500UL))
#define bFM3_GPIO_DDRA_P1                      *((volatile unsigned int*)(0x42664504UL))
#define bFM3_GPIO_DDRA_P2                      *((volatile unsigned int*)(0x42664508UL))
#define bFM3_GPIO_DDRA_P3                      *((volatile unsigned int*)(0x4266450CUL))
#define bFM3_GPIO_DDRA_P4                      *((volatile unsigned int*)(0x42664510UL))
#define bFM3_GPIO_DDRA_P5                      *((volatile unsigned int*)(0x42664514UL))
#define bFM3_GPIO_DDRC_P0                      *((volatile unsigned int*)(0x42664600UL))
#define bFM3_GPIO_DDRC_P1                      *((volatile unsigned int*)(0x42664604UL))
#define bFM3_GPIO_DDRC_P2                      *((volatile unsigned int*)(0x42664608UL))
#define bFM3_GPIO_DDRC_P3                      *((volatile unsigned int*)(0x4266460CUL))
#define bFM3_GPIO_DDRC_P4                      *((volatile unsigned int*)(0x42664610UL))
#define bFM3_GPIO_DDRC_P5                      *((volatile unsigned int*)(0x42664614UL))
#define bFM3_GPIO_DDRC_P6                      *((volatile unsigned int*)(0x42664618UL))
#define bFM3_GPIO_DDRC_P7                      *((volatile unsigned int*)(0x4266461CUL))
#define bFM3_GPIO_DDRC_P8                      *((volatile unsigned int*)(0x42664620UL))
#define bFM3_GPIO_DDRC_P9                      *((volatile unsigned int*)(0x42664624UL))
#define bFM3_GPIO_DDRC_PA                      *((volatile unsigned int*)(0x42664628UL))
#define bFM3_GPIO_DDRC_PB                      *((volatile unsigned int*)(0x4266462CUL))
#define bFM3_GPIO_DDRC_PC                      *((volatile unsigned int*)(0x42664630UL))
#define bFM3_GPIO_DDRC_PD                      *((volatile unsigned int*)(0x42664634UL))
#define bFM3_GPIO_DDRC_PE                      *((volatile unsigned int*)(0x42664638UL))
#define bFM3_GPIO_DDRC_PF                      *((volatile unsigned int*)(0x4266463CUL))
#define bFM3_GPIO_DDRD_P0                      *((volatile unsigned int*)(0x42664680UL))
#define bFM3_GPIO_DDRD_P1                      *((volatile unsigned int*)(0x42664684UL))
#define bFM3_GPIO_DDRD_P2                      *((volatile unsigned int*)(0x42664688UL))
#define bFM3_GPIO_DDRD_P3                      *((volatile unsigned int*)(0x4266468CUL))
#define bFM3_GPIO_DDRE_P0                      *((volatile unsigned int*)(0x42664700UL))
#define bFM3_GPIO_DDRE_P2                      *((volatile unsigned int*)(0x42664708UL))
#define bFM3_GPIO_DDRE_P3                      *((volatile unsigned int*)(0x4266470CUL))
#define bFM3_GPIO_DDRF_P5                      *((volatile unsigned int*)(0x42664794UL))
#define bFM3_GPIO_DDRF_P6                      *((volatile unsigned int*)(0x42664798UL))
#define bFM3_GPIO_PDIR0_P0                     *((volatile unsigned int*)(0x42666000UL))
#define bFM3_GPIO_PDIR0_P1                     *((volatile unsigned int*)(0x42666004UL))
#define bFM3_GPIO_PDIR0_P2                     *((volatile unsigned int*)(0x42666008UL))
#define bFM3_GPIO_PDIR0_P3                     *((volatile unsigned int*)(0x4266600CUL))
#define bFM3_GPIO_PDIR0_P4                     *((volatile unsigned int*)(0x42666010UL))
#define bFM3_GPIO_PDIR0_P5                     *((volatile unsigned int*)(0x42666014UL))
#define bFM3_GPIO_PDIR0_P6                     *((volatile unsigned int*)(0x42666018UL))
#define bFM3_GPIO_PDIR0_P7                     *((volatile unsigned int*)(0x4266601CUL))
#define bFM3_GPIO_PDIR0_P8                     *((volatile unsigned int*)(0x42666020UL))
#define bFM3_GPIO_PDIR0_P9                     *((volatile unsigned int*)(0x42666024UL))
#define bFM3_GPIO_PDIR1_P0                     *((volatile unsigned int*)(0x42666080UL))
#define bFM3_GPIO_PDIR1_P1                     *((volatile unsigned int*)(0x42666084UL))
#define bFM3_GPIO_PDIR1_P2                     *((volatile unsigned int*)(0x42666088UL))
#define bFM3_GPIO_PDIR1_P3                     *((volatile unsigned int*)(0x4266608CUL))
#define bFM3_GPIO_PDIR1_P4                     *((volatile unsigned int*)(0x42666090UL))
#define bFM3_GPIO_PDIR1_P5                     *((volatile unsigned int*)(0x42666094UL))
#define bFM3_GPIO_PDIR1_P6                     *((volatile unsigned int*)(0x42666098UL))
#define bFM3_GPIO_PDIR1_P7                     *((volatile unsigned int*)(0x4266609CUL))
#define bFM3_GPIO_PDIR1_P8                     *((volatile unsigned int*)(0x426660A0UL))
#define bFM3_GPIO_PDIR1_P9                     *((volatile unsigned int*)(0x426660A4UL))
#define bFM3_GPIO_PDIR1_PA                     *((volatile unsigned int*)(0x426660A8UL))
#define bFM3_GPIO_PDIR1_PB                     *((volatile unsigned int*)(0x426660ACUL))
#define bFM3_GPIO_PDIR1_PC                     *((volatile unsigned int*)(0x426660B0UL))
#define bFM3_GPIO_PDIR1_PD                     *((volatile unsigned int*)(0x426660B4UL))
#define bFM3_GPIO_PDIR1_PE                     *((volatile unsigned int*)(0x426660B8UL))
#define bFM3_GPIO_PDIR1_PF                     *((volatile unsigned int*)(0x426660BCUL))
#define bFM3_GPIO_PDIR2_P0                     *((volatile unsigned int*)(0x42666100UL))
#define bFM3_GPIO_PDIR2_P1                     *((volatile unsigned int*)(0x42666104UL))
#define bFM3_GPIO_PDIR2_P2                     *((volatile unsigned int*)(0x42666108UL))
#define bFM3_GPIO_PDIR2_P3                     *((volatile unsigned int*)(0x4266610CUL))
#define bFM3_GPIO_PDIR2_P4                     *((volatile unsigned int*)(0x42666110UL))
#define bFM3_GPIO_PDIR2_P5                     *((volatile unsigned int*)(0x42666114UL))
#define bFM3_GPIO_PDIR2_P6                     *((volatile unsigned int*)(0x42666118UL))
#define bFM3_GPIO_PDIR2_P7                     *((volatile unsigned int*)(0x4266611CUL))
#define bFM3_GPIO_PDIR2_P8                     *((volatile unsigned int*)(0x42666120UL))
#define bFM3_GPIO_PDIR2_P9                     *((volatile unsigned int*)(0x42666124UL))
#define bFM3_GPIO_PDIR3_P6                     *((volatile unsigned int*)(0x42666198UL))
#define bFM3_GPIO_PDIR3_P7                     *((volatile unsigned int*)(0x4266619CUL))
#define bFM3_GPIO_PDIR3_P8                     *((volatile unsigned int*)(0x426661A0UL))
#define bFM3_GPIO_PDIR3_P9                     *((volatile unsigned int*)(0x426661A4UL))
#define bFM3_GPIO_PDIR3_PA                     *((volatile unsigned int*)(0x426661A8UL))
#define bFM3_GPIO_PDIR3_PB                     *((volatile unsigned int*)(0x426661ACUL))
#define bFM3_GPIO_PDIR3_PC                     *((volatile unsigned int*)(0x426661B0UL))
#define bFM3_GPIO_PDIR3_PD                     *((volatile unsigned int*)(0x426661B4UL))
#define bFM3_GPIO_PDIR3_PE                     *((volatile unsigned int*)(0x426661B8UL))
#define bFM3_GPIO_PDIR3_PF                     *((volatile unsigned int*)(0x426661BCUL))
#define bFM3_GPIO_PDIR4_P0                     *((volatile unsigned int*)(0x42666200UL))
#define bFM3_GPIO_PDIR4_P1                     *((volatile unsigned int*)(0x42666204UL))
#define bFM3_GPIO_PDIR4_P2                     *((volatile unsigned int*)(0x42666208UL))
#define bFM3_GPIO_PDIR4_P3                     *((volatile unsigned int*)(0x4266620CUL))
#define bFM3_GPIO_PDIR4_P4                     *((volatile unsigned int*)(0x42666210UL))
#define bFM3_GPIO_PDIR4_P5                     *((volatile unsigned int*)(0x42666214UL))
#define bFM3_GPIO_PDIR4_P6                     *((volatile unsigned int*)(0x42666218UL))
#define bFM3_GPIO_PDIR4_P7                     *((volatile unsigned int*)(0x4266621CUL))
#define bFM3_GPIO_PDIR4_P8                     *((volatile unsigned int*)(0x42666220UL))
#define bFM3_GPIO_PDIR4_P9                     *((volatile unsigned int*)(0x42666224UL))
#define bFM3_GPIO_PDIR4_PA                     *((volatile unsigned int*)(0x42666228UL))
#define bFM3_GPIO_PDIR4_PB                     *((volatile unsigned int*)(0x4266622CUL))
#define bFM3_GPIO_PDIR4_PC                     *((volatile unsigned int*)(0x42666230UL))
#define bFM3_GPIO_PDIR4_PD                     *((volatile unsigned int*)(0x42666234UL))
#define bFM3_GPIO_PDIR4_PE                     *((volatile unsigned int*)(0x42666238UL))
#define bFM3_GPIO_PDIR5_P0                     *((volatile unsigned int*)(0x42666280UL))
#define bFM3_GPIO_PDIR5_P1                     *((volatile unsigned int*)(0x42666284UL))
#define bFM3_GPIO_PDIR5_P2                     *((volatile unsigned int*)(0x42666288UL))
#define bFM3_GPIO_PDIR5_P3                     *((volatile unsigned int*)(0x4266628CUL))
#define bFM3_GPIO_PDIR5_P4                     *((volatile unsigned int*)(0x42666290UL))
#define bFM3_GPIO_PDIR5_P5                     *((volatile unsigned int*)(0x42666294UL))
#define bFM3_GPIO_PDIR5_P6                     *((volatile unsigned int*)(0x42666298UL))
#define bFM3_GPIO_PDIR5_P7                     *((volatile unsigned int*)(0x4266629CUL))
#define bFM3_GPIO_PDIR5_P8                     *((volatile unsigned int*)(0x426662A0UL))
#define bFM3_GPIO_PDIR5_P9                     *((volatile unsigned int*)(0x426662A4UL))
#define bFM3_GPIO_PDIR5_PA                     *((volatile unsigned int*)(0x426662A8UL))
#define bFM3_GPIO_PDIR5_PB                     *((volatile unsigned int*)(0x426662ACUL))
#define bFM3_GPIO_PDIR6_P0                     *((volatile unsigned int*)(0x42666300UL))
#define bFM3_GPIO_PDIR6_P1                     *((volatile unsigned int*)(0x42666304UL))
#define bFM3_GPIO_PDIR6_P2                     *((volatile unsigned int*)(0x42666308UL))
#define bFM3_GPIO_PDIR7_P0                     *((volatile unsigned int*)(0x42666380UL))
#define bFM3_GPIO_PDIR7_P1                     *((volatile unsigned int*)(0x42666384UL))
#define bFM3_GPIO_PDIR7_P2                     *((volatile unsigned int*)(0x42666388UL))
#define bFM3_GPIO_PDIR7_P3                     *((volatile unsigned int*)(0x4266638CUL))
#define bFM3_GPIO_PDIR7_P4                     *((volatile unsigned int*)(0x42666390UL))
#define bFM3_GPIO_PDIR7_P5                     *((volatile unsigned int*)(0x42666394UL))
#define bFM3_GPIO_PDIR7_P6                     *((volatile unsigned int*)(0x42666398UL))
#define bFM3_GPIO_PDIR7_P7                     *((volatile unsigned int*)(0x4266639CUL))
#define bFM3_GPIO_PDIR7_P8                     *((volatile unsigned int*)(0x426663A0UL))
#define bFM3_GPIO_PDIR7_P9                     *((volatile unsigned int*)(0x426663A4UL))
#define bFM3_GPIO_PDIR7_PA                     *((volatile unsigned int*)(0x426663A8UL))
#define bFM3_GPIO_PDIR8_P0                     *((volatile unsigned int*)(0x42666400UL))
#define bFM3_GPIO_PDIR8_P1                     *((volatile unsigned int*)(0x42666404UL))
#define bFM3_GPIO_PDIR8_P2                     *((volatile unsigned int*)(0x42666408UL))
#define bFM3_GPIO_PDIR8_P3                     *((volatile unsigned int*)(0x4266640CUL))
#define bFM3_GPIO_PDIRA_P0                     *((volatile unsigned int*)(0x42666500UL))
#define bFM3_GPIO_PDIRA_P1                     *((volatile unsigned int*)(0x42666504UL))
#define bFM3_GPIO_PDIRA_P2                     *((volatile unsigned int*)(0x42666508UL))
#define bFM3_GPIO_PDIRA_P3                     *((volatile unsigned int*)(0x4266650CUL))
#define bFM3_GPIO_PDIRA_P4                     *((volatile unsigned int*)(0x42666510UL))
#define bFM3_GPIO_PDIRA_P5                     *((volatile unsigned int*)(0x42666514UL))
#define bFM3_GPIO_PDIRC_P0                     *((volatile unsigned int*)(0x42666600UL))
#define bFM3_GPIO_PDIRC_P1                     *((volatile unsigned int*)(0x42666604UL))
#define bFM3_GPIO_PDIRC_P2                     *((volatile unsigned int*)(0x42666608UL))
#define bFM3_GPIO_PDIRC_P3                     *((volatile unsigned int*)(0x4266660CUL))
#define bFM3_GPIO_PDIRC_P4                     *((volatile unsigned int*)(0x42666610UL))
#define bFM3_GPIO_PDIRC_P5                     *((volatile unsigned int*)(0x42666614UL))
#define bFM3_GPIO_PDIRC_P6                     *((volatile unsigned int*)(0x42666618UL))
#define bFM3_GPIO_PDIRC_P7                     *((volatile unsigned int*)(0x4266661CUL))
#define bFM3_GPIO_PDIRC_P8                     *((volatile unsigned int*)(0x42666620UL))
#define bFM3_GPIO_PDIRC_P9                     *((volatile unsigned int*)(0x42666624UL))
#define bFM3_GPIO_PDIRC_PA                     *((volatile unsigned int*)(0x42666628UL))
#define bFM3_GPIO_PDIRC_PB                     *((volatile unsigned int*)(0x4266662CUL))
#define bFM3_GPIO_PDIRC_PC                     *((volatile unsigned int*)(0x42666630UL))
#define bFM3_GPIO_PDIRC_PD                     *((volatile unsigned int*)(0x42666634UL))
#define bFM3_GPIO_PDIRC_PE                     *((volatile unsigned int*)(0x42666638UL))
#define bFM3_GPIO_PDIRC_PF                     *((volatile unsigned int*)(0x4266663CUL))
#define bFM3_GPIO_PDIRD_P0                     *((volatile unsigned int*)(0x42666680UL))
#define bFM3_GPIO_PDIRD_P1                     *((volatile unsigned int*)(0x42666684UL))
#define bFM3_GPIO_PDIRD_P2                     *((volatile unsigned int*)(0x42666688UL))
#define bFM3_GPIO_PDIRD_P3                     *((volatile unsigned int*)(0x4266668CUL))
#define bFM3_GPIO_PDIRE_P0                     *((volatile unsigned int*)(0x42666700UL))
#define bFM3_GPIO_PDIRE_P2                     *((volatile unsigned int*)(0x42666708UL))
#define bFM3_GPIO_PDIRE_P3                     *((volatile unsigned int*)(0x4266670CUL))
#define bFM3_GPIO_PDIRF_P5                     *((volatile unsigned int*)(0x42666794UL))
#define bFM3_GPIO_PDIRF_P6                     *((volatile unsigned int*)(0x42666798UL))
#define bFM3_GPIO_PDOR0_P0                     *((volatile unsigned int*)(0x42668000UL))
#define bFM3_GPIO_PDOR0_P1                     *((volatile unsigned int*)(0x42668004UL))
#define bFM3_GPIO_PDOR0_P2                     *((volatile unsigned int*)(0x42668008UL))
#define bFM3_GPIO_PDOR0_P3                     *((volatile unsigned int*)(0x4266800CUL))
#define bFM3_GPIO_PDOR0_P4                     *((volatile unsigned int*)(0x42668010UL))
#define bFM3_GPIO_PDOR0_P5                     *((volatile unsigned int*)(0x42668014UL))
#define bFM3_GPIO_PDOR0_P6                     *((volatile unsigned int*)(0x42668018UL))
#define bFM3_GPIO_PDOR0_P7                     *((volatile unsigned int*)(0x4266801CUL))
#define bFM3_GPIO_PDOR0_P8                     *((volatile unsigned int*)(0x42668020UL))
#define bFM3_GPIO_PDOR0_P9                     *((volatile unsigned int*)(0x42668024UL))
#define bFM3_GPIO_PDOR1_P0                     *((volatile unsigned int*)(0x42668080UL))
#define bFM3_GPIO_PDOR1_P1                     *((volatile unsigned int*)(0x42668084UL))
#define bFM3_GPIO_PDOR1_P2                     *((volatile unsigned int*)(0x42668088UL))
