RT-Thread/rt-thread/bsp/mb9bf618s/CMSIS/DeviceSupport/fujitsu/mb9bf61x/mb9b610s.h
#define bFM3_USB1_EP0OS_SIZE2                  *((volatile unsigned int*)(0x42A42908UL))
#define bFM3_USB1_EP0OS_SIZE3                  *((volatile unsigned int*)(0x42A4290CUL))
#define bFM3_USB1_EP0OS_SIZE4                  *((volatile unsigned int*)(0x42A42910UL))
#define bFM3_USB1_EP0OS_SIZE5                  *((volatile unsigned int*)(0x42A42914UL))
#define bFM3_USB1_EP0OS_SIZE6                  *((volatile unsigned int*)(0x42A42918UL))
#define bFM3_USB1_EP0OS_SPK                    *((volatile unsigned int*)(0x42A42924UL))
#define bFM3_USB1_EP0OS_DRQO                   *((volatile unsigned int*)(0x42A42928UL))
#define bFM3_USB1_EP0OS_SPKIE                  *((volatile unsigned int*)(0x42A42934UL))
#define bFM3_USB1_EP0OS_DRQOIE                 *((volatile unsigned int*)(0x42A42938UL))
#define bFM3_USB1_EP0OS_BFINI                  *((volatile unsigned int*)(0x42A4293CUL))
#define bFM3_USB1_EP1S_SIZE10                  *((volatile unsigned int*)(0x42A42980UL))
#define bFM3_USB1_EP1S_SIZE11                  *((volatile unsigned int*)(0x42A42984UL))
#define bFM3_USB1_EP1S_SIZE12                  *((volatile unsigned int*)(0x42A42988UL))
#define bFM3_USB1_EP1S_SIZE13                  *((volatile unsigned int*)(0x42A4298CUL))
#define bFM3_USB1_EP1S_SIZE14                  *((volatile unsigned int*)(0x42A42990UL))
#define bFM3_USB1_EP1S_SIZE15                  *((volatile unsigned int*)(0x42A42994UL))
#define bFM3_USB1_EP1S_SIZE16                  *((volatile unsigned int*)(0x42A42998UL))
#define bFM3_USB1_EP1S_SIZE17                  *((volatile unsigned int*)(0x42A4299CUL))
#define bFM3_USB1_EP1S_SIZE18                  *((volatile unsigned int*)(0x42A429A0UL))
#define bFM3_USB1_EP1S_SPK                     *((volatile unsigned int*)(0x42A429A4UL))
#define bFM3_USB1_EP1S_DRQ                     *((volatile unsigned int*)(0x42A429A8UL))
#define bFM3_USB1_EP1S_BUSY                    *((volatile unsigned int*)(0x42A429ACUL))
#define bFM3_USB1_EP1S_SPKIE                   *((volatile unsigned int*)(0x42A429B4UL))
#define bFM3_USB1_EP1S_DRQIE                   *((volatile unsigned int*)(0x42A429B8UL))
#define bFM3_USB1_EP1S_BFINI                   *((volatile unsigned int*)(0x42A429BCUL))
#define bFM3_USB1_EP2S_SIZE20                  *((volatile unsigned int*)(0x42A42A00UL))
#define bFM3_USB1_EP2S_SIZE21                  *((volatile unsigned int*)(0x42A42A04UL))
#define bFM3_USB1_EP2S_SIZE22                  *((volatile unsigned int*)(0x42A42A08UL))
#define bFM3_USB1_EP2S_SIZE23                  *((volatile unsigned int*)(0x42A42A0CUL))
#define bFM3_USB1_EP2S_SIZE24                  *((volatile unsigned int*)(0x42A42A10UL))
#define bFM3_USB1_EP2S_SIZE25                  *((volatile unsigned int*)(0x42A42A14UL))
#define bFM3_USB1_EP2S_SIZE26                  *((volatile unsigned int*)(0x42A42A18UL))
#define bFM3_USB1_EP2S_SPK                     *((volatile unsigned int*)(0x42A42A24UL))
#define bFM3_USB1_EP2S_DRQ                     *((volatile unsigned int*)(0x42A42A28UL))
#define bFM3_USB1_EP2S_BUSY                    *((volatile unsigned int*)(0x42A42A2CUL))
#define bFM3_USB1_EP2S_SPKIE                   *((volatile unsigned int*)(0x42A42A34UL))
#define bFM3_USB1_EP2S_DRQIE                   *((volatile unsigned int*)(0x42A42A38UL))
#define bFM3_USB1_EP2S_BFINI                   *((volatile unsigned int*)(0x42A42A3CUL))
#define bFM3_USB1_EP3S_SIZE30                  *((volatile unsigned int*)(0x42A42A80UL))
#define bFM3_USB1_EP3S_SIZE31                  *((volatile unsigned int*)(0x42A42A84UL))
#define bFM3_USB1_EP3S_SIZE32                  *((volatile unsigned int*)(0x42A42A88UL))
#define bFM3_USB1_EP3S_SIZE33                  *((volatile unsigned int*)(0x42A42A8CUL))
#define bFM3_USB1_EP3S_SIZE34                  *((volatile unsigned int*)(0x42A42A90UL))
#define bFM3_USB1_EP3S_SIZE35                  *((volatile unsigned int*)(0x42A42A94UL))
#define bFM3_USB1_EP3S_SIZE36                  *((volatile unsigned int*)(0x42A42A98UL))
#define bFM3_USB1_EP3S_SPK                     *((volatile unsigned int*)(0x42A42AA4UL))
#define bFM3_USB1_EP3S_DRQ                     *((volatile unsigned int*)(0x42A42AA8UL))
#define bFM3_USB1_EP3S_BUSY                    *((volatile unsigned int*)(0x42A42AACUL))
#define bFM3_USB1_EP3S_SPKIE                   *((volatile unsigned int*)(0x42A42AB4UL))
#define bFM3_USB1_EP3S_DRQIE                   *((volatile unsigned int*)(0x42A42AB8UL))
#define bFM3_USB1_EP3S_BFINI                   *((volatile unsigned int*)(0x42A42ABCUL))
#define bFM3_USB1_EP4S_SIZE40                  *((volatile unsigned int*)(0x42A42B00UL))
#define bFM3_USB1_EP4S_SIZE41                  *((volatile unsigned int*)(0x42A42B04UL))
#define bFM3_USB1_EP4S_SIZE42                  *((volatile unsigned int*)(0x42A42B08UL))
#define bFM3_USB1_EP4S_SIZE43                  *((volatile unsigned int*)(0x42A42B0CUL))
#define bFM3_USB1_EP4S_SIZE44                  *((volatile unsigned int*)(0x42A42B10UL))
#define bFM3_USB1_EP4S_SIZE45                  *((volatile unsigned int*)(0x42A42B14UL))
#define bFM3_USB1_EP4S_SIZE46                  *((volatile unsigned int*)(0x42A42B18UL))
#define bFM3_USB1_EP4S_SPK                     *((volatile unsigned int*)(0x42A42B24UL))
#define bFM3_USB1_EP4S_DRQ                     *((volatile unsigned int*)(0x42A42B28UL))
#define bFM3_USB1_EP4S_BUSY                    *((volatile unsigned int*)(0x42A42B2CUL))
#define bFM3_USB1_EP4S_SPKIE                   *((volatile unsigned int*)(0x42A42B34UL))
#define bFM3_USB1_EP4S_DRQIE                   *((volatile unsigned int*)(0x42A42B38UL))
#define bFM3_USB1_EP4S_BFINI                   *((volatile unsigned int*)(0x42A42B3CUL))
#define bFM3_USB1_EP5S_SIZE50                  *((volatile unsigned int*)(0x42A42B80UL))
#define bFM3_USB1_EP5S_SIZE51                  *((volatile unsigned int*)(0x42A42B84UL))
#define bFM3_USB1_EP5S_SIZE52                  *((volatile unsigned int*)(0x42A42B88UL))
#define bFM3_USB1_EP5S_SIZE53                  *((volatile unsigned int*)(0x42A42B8CUL))
#define bFM3_USB1_EP5S_SIZE54                  *((volatile unsigned int*)(0x42A42B90UL))
#define bFM3_USB1_EP5S_SIZE55                  *((volatile unsigned int*)(0x42A42B94UL))
#define bFM3_USB1_EP5S_SIZE56                  *((volatile unsigned int*)(0x42A42B98UL))
#define bFM3_USB1_EP5S_SPK                     *((volatile unsigned int*)(0x42A42BA4UL))
#define bFM3_USB1_EP5S_DRQ                     *((volatile unsigned int*)(0x42A42BA8UL))
#define bFM3_USB1_EP5S_BUSY                    *((volatile unsigned int*)(0x42A42BACUL))
#define bFM3_USB1_EP5S_SPKIE                   *((volatile unsigned int*)(0x42A42BB4UL))
#define bFM3_USB1_EP5S_DRQIE                   *((volatile unsigned int*)(0x42A42BB8UL))
#define bFM3_USB1_EP5S_BFINI                   *((volatile unsigned int*)(0x42A42BBCUL))

