RT-Thread/rt-thread/bsp/mb9bf618s/CMSIS/DeviceSupport/fujitsu/mb9bf61x/mb9b610s.h
#define bFM3_ETHERNET_MAC1_MAR5H_A38           *((volatile unsigned int*)(0x42CE0D18UL))
#define bFM3_ETHERNET_MAC1_MAR5H_A39           *((volatile unsigned int*)(0x42CE0D1CUL))
#define bFM3_ETHERNET_MAC1_MAR5H_A40           *((volatile unsigned int*)(0x42CE0D20UL))
#define bFM3_ETHERNET_MAC1_MAR5H_A41           *((volatile unsigned int*)(0x42CE0D24UL))
#define bFM3_ETHERNET_MAC1_MAR5H_A42           *((volatile unsigned int*)(0x42CE0D28UL))
#define bFM3_ETHERNET_MAC1_MAR5H_A43           *((volatile unsigned int*)(0x42CE0D2CUL))
#define bFM3_ETHERNET_MAC1_MAR5H_A44           *((volatile unsigned int*)(0x42CE0D30UL))
#define bFM3_ETHERNET_MAC1_MAR5H_A45           *((volatile unsigned int*)(0x42CE0D34UL))
#define bFM3_ETHERNET_MAC1_MAR5H_A46           *((volatile unsigned int*)(0x42CE0D38UL))
#define bFM3_ETHERNET_MAC1_MAR5H_A47           *((volatile unsigned int*)(0x42CE0D3CUL))
#define bFM3_ETHERNET_MAC1_MAR5H_MBC0          *((volatile unsigned int*)(0x42CE0D60UL))
#define bFM3_ETHERNET_MAC1_MAR5H_MBC1          *((volatile unsigned int*)(0x42CE0D64UL))
#define bFM3_ETHERNET_MAC1_MAR5H_MBC2          *((volatile unsigned int*)(0x42CE0D68UL))
#define bFM3_ETHERNET_MAC1_MAR5H_MBC3          *((volatile unsigned int*)(0x42CE0D6CUL))
#define bFM3_ETHERNET_MAC1_MAR5H_MBC4          *((volatile unsigned int*)(0x42CE0D70UL))
#define bFM3_ETHERNET_MAC1_MAR5H_MBC5          *((volatile unsigned int*)(0x42CE0D74UL))
#define bFM3_ETHERNET_MAC1_MAR5H_SA            *((volatile unsigned int*)(0x42CE0D78UL))
#define bFM3_ETHERNET_MAC1_MAR5H_AE            *((volatile unsigned int*)(0x42CE0D7CUL))
#define bFM3_ETHERNET_MAC1_MAR5L_A0            *((volatile unsigned int*)(0x42CE0D80UL))
#define bFM3_ETHERNET_MAC1_MAR5L_A1            *((volatile unsigned int*)(0x42CE0D84UL))
#define bFM3_ETHERNET_MAC1_MAR5L_A2            *((volatile unsigned int*)(0x42CE0D88UL))
#define bFM3_ETHERNET_MAC1_MAR5L_A3            *((volatile unsigned int*)(0x42CE0D8CUL))
#define bFM3_ETHERNET_MAC1_MAR5L_A4            *((volatile unsigned int*)(0x42CE0D90UL))
#define bFM3_ETHERNET_MAC1_MAR5L_A5            *((volatile unsigned int*)(0x42CE0D94UL))
#define bFM3_ETHERNET_MAC1_MAR5L_A6            *((volatile unsigned int*)(0x42CE0D98UL))
#define bFM3_ETHERNET_MAC1_MAR5L_A7            *((volatile unsigned int*)(0x42CE0D9CUL))
#define bFM3_ETHERNET_MAC1_MAR5L_A8            *((volatile unsigned int*)(0x42CE0DA0UL))
#define bFM3_ETHERNET_MAC1_MAR5L_A9            *((volatile unsigned int*)(0x42CE0DA4UL))
#define bFM3_ETHERNET_MAC1_MAR5L_A10           *((volatile unsigned int*)(0x42CE0DA8UL))
#define bFM3_ETHERNET_MAC1_MAR5L_A11           *((volatile unsigned int*)(0x42CE0DACUL))
#define bFM3_ETHERNET_MAC1_MAR5L_A12           *((volatile unsigned int*)(0x42CE0DB0UL))
#define bFM3_ETHERNET_MAC1_MAR5L_A13           *((volatile unsigned int*)(0x42CE0DB4UL))
#define bFM3_ETHERNET_MAC1_MAR5L_A14           *((volatile unsigned int*)(0x42CE0DB8UL))
#define bFM3_ETHERNET_MAC1_MAR5L_A15           *((volatile unsigned int*)(0x42CE0DBCUL))
#define bFM3_ETHERNET_MAC1_MAR5L_A16           *((volatile unsigned int*)(0x42CE0DC0UL))
#define bFM3_ETHERNET_MAC1_MAR5L_A17           *((volatile unsigned int*)(0x42CE0DC4UL))
#define bFM3_ETHERNET_MAC1_MAR5L_A18           *((volatile unsigned int*)(0x42CE0DC8UL))
#define bFM3_ETHERNET_MAC1_MAR5L_A19           *((volatile unsigned int*)(0x42CE0DCCUL))
#define bFM3_ETHERNET_MAC1_MAR5L_A20           *((volatile unsigned int*)(0x42CE0DD0UL))
#define bFM3_ETHERNET_MAC1_MAR5L_A21           *((volatile unsigned int*)(0x42CE0DD4UL))
#define bFM3_ETHERNET_MAC1_MAR5L_A22           *((volatile unsigned int*)(0x42CE0DD8UL))
#define bFM3_ETHERNET_MAC1_MAR5L_A23           *((volatile unsigned int*)(0x42CE0DDCUL))
#define bFM3_ETHERNET_MAC1_MAR5L_A24           *((volatile unsigned int*)(0x42CE0DE0UL))
#define bFM3_ETHERNET_MAC1_MAR5L_A25           *((volatile unsigned int*)(0x42CE0DE4UL))
#define bFM3_ETHERNET_MAC1_MAR5L_A26           *((volatile unsigned int*)(0x42CE0DE8UL))
#define bFM3_ETHERNET_MAC1_MAR5L_A27           *((volatile unsigned int*)(0x42CE0DECUL))
#define bFM3_ETHERNET_MAC1_MAR5L_A28           *((volatile unsigned int*)(0x42CE0DF0UL))
#define bFM3_ETHERNET_MAC1_MAR5L_A29           *((volatile unsigned int*)(0x42CE0DF4UL))
#define bFM3_ETHERNET_MAC1_MAR5L_A30           *((volatile unsigned int*)(0x42CE0DF8UL))
#define bFM3_ETHERNET_MAC1_MAR5L_A31           *((volatile unsigned int*)(0x42CE0DFCUL))
#define bFM3_ETHERNET_MAC1_MAR6H_A32           *((volatile unsigned int*)(0x42CE0E00UL))
#define bFM3_ETHERNET_MAC1_MAR6H_A33           *((volatile unsigned int*)(0x42CE0E04UL))
#define bFM3_ETHERNET_MAC1_MAR6H_A34           *((volatile unsigned int*)(0x42CE0E08UL))
#define bFM3_ETHERNET_MAC1_MAR6H_A35           *((volatile unsigned int*)(0x42CE0E0CUL))
#define bFM3_ETHERNET_MAC1_MAR6H_A36           *((volatile unsigned int*)(0x42CE0E10UL))
#define bFM3_ETHERNET_MAC1_MAR6H_A37           *((volatile unsigned int*)(0x42CE0E14UL))
#define bFM3_ETHERNET_MAC1_MAR6H_A38           *((volatile unsigned int*)(0x42CE0E18UL))
#define bFM3_ETHERNET_MAC1_MAR6H_A39           *((volatile unsigned int*)(0x42CE0E1CUL))
#define bFM3_ETHERNET_MAC1_MAR6H_A40           *((volatile unsigned int*)(0x42CE0E20UL))
#define bFM3_ETHERNET_MAC1_MAR6H_A41           *((volatile unsigned int*)(0x42CE0E24UL))
#define bFM3_ETHERNET_MAC1_MAR6H_A42           *((volatile unsigned int*)(0x42CE0E28UL))
#define bFM3_ETHERNET_MAC1_MAR6H_A43           *((volatile unsigned int*)(0x42CE0E2CUL))
#define bFM3_ETHERNET_MAC1_MAR6H_A44           *((volatile unsigned int*)(0x42CE0E30UL))
#define bFM3_ETHERNET_MAC1_MAR6H_A45           *((volatile unsigned int*)(0x42CE0E34UL))
#define bFM3_ETHERNET_MAC1_MAR6H_A46           *((volatile unsigned int*)(0x42CE0E38UL))
#define bFM3_ETHERNET_MAC1_MAR6H_A47           *((volatile unsigned int*)(0x42CE0E3CUL))
#define bFM3_ETHERNET_MAC1_MAR6H_MBC0          *((volatile unsigned int*)(0x42CE0E60UL))
#define bFM3_ETHERNET_MAC1_MAR6H_MBC1          *((volatile unsigned int*)(0x42CE0E64UL))
#define bFM3_ETHERNET_MAC1_MAR6H_MBC2          *((volatile unsigned int*)(0x42CE0E68UL))
#define bFM3_ETHERNET_MAC1_MAR6H_MBC3          *((volatile unsigned int*)(0x42CE0E6CUL))
#define bFM3_ETHERNET_MAC1_MAR6H_MBC4          *((volatile unsigned int*)(0x42CE0E70UL))
#define bFM3_ETHERNET_MAC1_MAR6H_MBC5          *((volatile unsigned int*)(0x42CE0E74UL))
#define bFM3_ETHERNET_MAC1_MAR6H_SA            *((volatile unsigned int*)(0x42CE0E78UL))
#define bFM3_ETHERNET_MAC1_MAR6H_AE            *((volatile unsigned int*)(0x42CE0E7CUL))
#define bFM3_ETHERNET_MAC1_MAR6L_A0            *((volatile unsigned int*)(0x42CE0E80UL))
#define bFM3_ETHERNET_MAC1_MAR6L_A1            *((volatile unsigned int*)(0x42CE0E84UL))
#define bFM3_ETHERNET_MAC1_MAR6L_A2            *((volatile unsigned int*)(0x42CE0E88UL))
#define bFM3_ETHERNET_MAC1_MAR6L_A3            *((volatile unsigned int*)(0x42CE0E8CUL))
#define bFM3_ETHERNET_MAC1_MAR6L_A4            *((volatile unsigned int*)(0x42CE0E90UL))
#define bFM3_ETHERNET_MAC1_MAR6L_A5            *((volatile unsigned int*)(0x42CE0E94UL))
#define bFM3_ETHERNET_MAC1_MAR6L_A6            *((volatile unsigned int*)(0x42CE0E98UL))
#define bFM3_ETHERNET_MAC1_MAR6L_A7            *((volatile unsigned int*)(0x42CE0E9CUL))
#define bFM3_ETHERNET_MAC1_MAR6L_A8            *((volatile unsigned int*)(0x42CE0EA0UL))
#define bFM3_ETHERNET_MAC1_MAR6L_A9            *((volatile unsigned int*)(0x42CE0EA4UL))
#define bFM3_ETHERNET_MAC1_MAR6L_A10           *((volatile unsigned int*)(0x42CE0EA8UL))
#define bFM3_ETHERNET_MAC1_MAR6L_A11           *((volatile unsigned int*)(0x42CE0EACUL))
#define bFM3_ETHERNET_MAC1_MAR6L_A12           *((volatile unsigned int*)(0x42CE0EB0UL))
#define bFM3_ETHERNET_MAC1_MAR6L_A13           *((volatile unsigned int*)(0x42CE0EB4UL))
#define bFM3_ETHERNET_MAC1_MAR6L_A14           *((volatile unsigned int*)(0x42CE0EB8UL))
#define bFM3_ETHERNET_MAC1_MAR6L_A15           *((volatile unsigned int*)(0x42CE0EBCUL))
#define bFM3_ETHERNET_MAC1_MAR6L_A16           *((volatile unsigned int*)(0x42CE0EC0UL))
#define bFM3_ETHERNET_MAC1_MAR6L_A17           *((volatile unsigned int*)(0x42CE0EC4UL))
#define bFM3_ETHERNET_MAC1_MAR6L_A18           *((volatile unsigned int*)(0x42CE0EC8UL))
#define bFM3_ETHERNET_MAC1_MAR6L_A19           *((volatile unsigned int*)(0x42CE0ECCUL))
#define bFM3_ETHERNET_MAC1_MAR6L_A20           *((volatile unsigned int*)(0x42CE0ED0UL))
#define bFM3_ETHERNET_MAC1_MAR6L_A21           *((volatile unsigned int*)(0x42CE0ED4UL))
#define bFM3_ETHERNET_MAC1_MAR6L_A22           *((volatile unsigned int*)(0x42CE0ED8UL))
#define bFM3_ETHERNET_MAC1_MAR6L_A23           *((volatile unsigned int*)(0x42CE0EDCUL))
#define bFM3_ETHERNET_MAC1_MAR6L_A24           *((volatile unsigned int*)(0x42CE0EE0UL))
#define bFM3_ETHERNET_MAC1_MAR6L_A25           *((volatile unsigned int*)(0x42CE0EE4UL))
#define bFM3_ETHERNET_MAC1_MAR6L_A26           *((volatile unsigned int*)(0x42CE0EE8UL))
#define bFM3_ETHERNET_MAC1_MAR6L_A27           *((volatile unsigned int*)(0x42CE0EECUL))
#define bFM3_ETHERNET_MAC1_MAR6L_A28           *((volatile unsigned int*)(0x42CE0EF0UL))
#define bFM3_ETHERNET_MAC1_MAR6L_A29           *((volatile unsigned int*)(0x42CE0EF4UL))
#define bFM3_ETHERNET_MAC1_MAR6L_A30           *((volatile unsigned int*)(0x42CE0EF8UL))
#define bFM3_ETHERNET_MAC1_MAR6L_A31           *((volatile unsigned int*)(0x42CE0EFCUL))
#define bFM3_ETHERNET_MAC1_MAR7H_A32           *((volatile unsigned int*)(0x42CE0F00UL))
#define bFM3_ETHERNET_MAC1_MAR7H_A33           *((volatile unsigned int*)(0x42CE0F04UL))
#define bFM3_ETHERNET_MAC1_MAR7H_A34           *((volatile unsigned int*)(0x42CE0F08UL))
#define bFM3_ETHERNET_MAC1_MAR7H_A35           *((volatile unsigned int*)(0x42CE0F0CUL))
#define bFM3_ETHERNET_MAC1_MAR7H_A36           *((volatile unsigned int*)(0x42CE0F10UL))
#define bFM3_ETHERNET_MAC1_MAR7H_A37           *((volatile unsigned int*)(0x42CE0F14UL))
#define bFM3_ETHERNET_MAC1_MAR7H_A38           *((volatile unsigned int*)(0x42CE0F18UL))
#define bFM3_ETHERNET_MAC1_MAR7H_A39           *((volatile unsigned int*)(0x42CE0F1CUL))
#define bFM3_ETHERNET_MAC1_MAR7H_A40           *((volatile unsigned int*)(0x42CE0F20UL))
#define bFM3_ETHERNET_MAC1_MAR7H_A41           *((volatile unsigned int*)(0x42CE0F24UL))
#define bFM3_ETHERNET_MAC1_MAR7H_A42           *((volatile unsigned int*)(0x42CE0F28UL))
#define bFM3_ETHERNET_MAC1_MAR7H_A43           *((volatile unsigned int*)(0x42CE0F2CUL))
#define bFM3_ETHERNET_MAC1_MAR7H_A44           *((volatile unsigned int*)(0x42CE0F30UL))
#define bFM3_ETHERNET_MAC1_MAR7H_A45           *((volatile unsigned int*)(0x42CE0F34UL))
#define bFM3_ETHERNET_MAC1_MAR7H_A46           *((volatile unsigned int*)(0x42CE0F38UL))
#define bFM3_ETHERNET_MAC1_MAR7H_A47           *((volatile unsigned int*)(0x42CE0F3CUL))
#define bFM3_ETHERNET_MAC1_MAR7H_MBC0          *((volatile unsigned int*)(0x42CE0F60UL))
#define bFM3_ETHERNET_MAC1_MAR7H_MBC1          *((volatile unsigned int*)(0x42CE0F64UL))
#define bFM3_ETHERNET_MAC1_MAR7H_MBC2          *((volatile unsigned int*)(0x42CE0F68UL))
#define bFM3_ETHERNET_MAC1_MAR7H_MBC3          *((volatile unsigned int*)(0x42CE0F6CUL))
#define bFM3_ETHERNET_MAC1_MAR7H_MBC4          *((volatile unsigned int*)(0x42CE0F70UL))
#define bFM3_ETHERNET_MAC1_MAR7H_MBC5          *((volatile unsigned int*)(0x42CE0F74UL))
#define bFM3_ETHERNET_MAC1_MAR7H_SA            *((volatile unsigned int*)(0x42CE0F78UL))
#define bFM3_ETHERNET_MAC1_MAR7H_AE            *((volatile unsigned int*)(0x42CE0F7CUL))
#define bFM3_ETHERNET_MAC1_MAR7L_A0            *((volatile unsigned int*)(0x42CE0F80UL))
#define bFM3_ETHERNET_MAC1_MAR7L_A1            *((volatile unsigned int*)(0x42CE0F84UL))
#define bFM3_ETHERNET_MAC1_MAR7L_A2            *((volatile unsigned int*)(0x42CE0F88UL))
#define bFM3_ETHERNET_MAC1_MAR7L_A3            *((volatile unsigned int*)(0x42CE0F8CUL))
#define bFM3_ETHERNET_MAC1_MAR7L_A4            *((volatile unsigned int*)(0x42CE0F90UL))
#define bFM3_ETHERNET_MAC1_MAR7L_A5            *((volatile unsigned int*)(0x42CE0F94UL))
#define bFM3_ETHERNET_MAC1_MAR7L_A6            *((volatile unsigned int*)(0x42CE0F98UL))
#define bFM3_ETHERNET_MAC1_MAR7L_A7            *((volatile unsigned int*)(0x42CE0F9CUL))
#define bFM3_ETHERNET_MAC1_MAR7L_A8            *((volatile unsigned int*)(0x42CE0FA0UL))
#define bFM3_ETHERNET_MAC1_MAR7L_A9            *((volatile unsigned int*)(0x42CE0FA4UL))
#define bFM3_ETHERNET_MAC1_MAR7L_A10           *((volatile unsigned int*)(0x42CE0FA8UL))
#define bFM3_ETHERNET_MAC1_MAR7L_A11           *((volatile unsigned int*)(0x42CE0FACUL))
#define bFM3_ETHERNET_MAC1_MAR7L_A12           *((volatile unsigned int*)(0x42CE0FB0UL))
#define bFM3_ETHERNET_MAC1_MAR7L_A13           *((volatile unsigned int*)(0x42CE0FB4UL))
#define bFM3_ETHERNET_MAC1_MAR7L_A14           *((volatile unsigned int*)(0x42CE0FB8UL))
#define bFM3_ETHERNET_MAC1_MAR7L_A15           *((volatile unsigned int*)(0x42CE0FBCUL))
#define bFM3_ETHERNET_MAC1_MAR7L_A16           *((volatile unsigned int*)(0x42CE0FC0UL))
#define bFM3_ETHERNET_MAC1_MAR7L_A17           *((volatile unsigned int*)(0x42CE0FC4UL))
#define bFM3_ETHERNET_MAC1_MAR7L_A18           *((volatile unsigned int*)(0x42CE0FC8UL))
#define bFM3_ETHERNET_MAC1_MAR7L_A19           *((volatile unsigned int*)(0x42CE0FCCUL))
#define bFM3_ETHERNET_MAC1_MAR7L_A20           *((volatile unsigned int*)(0x42CE0FD0UL))
#define bFM3_ETHERNET_MAC1_MAR7L_A21           *((volatile unsigned int*)(0x42CE0FD4UL))
#define bFM3_ETHERNET_MAC1_MAR7L_A22           *((volatile unsigned int*)(0x42CE0FD8UL))
#define bFM3_ETHERNET_MAC1_MAR7L_A23           *((volatile unsigned int*)(0x42CE0FDCUL))
#define bFM3_ETHERNET_MAC1_MAR7L_A24           *((volatile unsigned int*)(0x42CE0FE0UL))
#define bFM3_ETHERNET_MAC1_MAR7L_A25           *((volatile unsigned int*)(0x42CE0FE4UL))
#define bFM3_ETHERNET_MAC1_MAR7L_A26           *((volatile unsigned int*)(0x42CE0FE8UL))
#define bFM3_ETHERNET_MAC1_MAR7L_A27           *((volatile unsigned int*)(0x42CE0FECUL))
#define bFM3_ETHERNET_MAC1_MAR7L_A28           *((volatile unsigned int*)(0x42CE0FF0UL))
#define bFM3_ETHERNET_MAC1_MAR7L_A29           *((volatile unsigned int*)(0x42CE0FF4UL))
#define bFM3_ETHERNET_MAC1_MAR7L_A30           *((volatile unsigned int*)(0x42CE0FF8UL))
#define bFM3_ETHERNET_MAC1_MAR7L_A31           *((volatile unsigned int*)(0x42CE0FFCUL))
#define bFM3_ETHERNET_MAC1_MAR8H_A32           *((volatile unsigned int*)(0x42CE1000UL))
#define bFM3_ETHERNET_MAC1_MAR8H_A33           *((volatile unsigned int*)(0x42CE1004UL))
#define bFM3_ETHERNET_MAC1_MAR8H_A34           *((volatile unsigned int*)(0x42CE1008UL))
#define bFM3_ETHERNET_MAC1_MAR8H_A35           *((volatile unsigned int*)(0x42CE100CUL))
#define bFM3_ETHERNET_MAC1_MAR8H_A36           *((volatile unsigned int*)(0x42CE1010UL))
#define bFM3_ETHERNET_MAC1_MAR8H_A37           *((volatile unsigned int*)(0x42CE1014UL))
#define bFM3_ETHERNET_MAC1_MAR8H_A38           *((volatile unsigned int*)(0x42CE1018UL))
#define bFM3_ETHERNET_MAC1_MAR8H_A39           *((volatile unsigned int*)(0x42CE101CUL))
#define bFM3_ETHERNET_MAC1_MAR8H_A40           *((volatile unsigned int*)(0x42CE1020UL))
#define bFM3_ETHERNET_MAC1_MAR8H_A41           *((volatile unsigned int*)(0x42CE1024UL))
#define bFM3_ETHERNET_MAC1_MAR8H_A42           *((volatile unsigned int*)(0x42CE1028UL))
#define bFM3_ETHERNET_MAC1_MAR8H_A43           *((volatile unsigned int*)(0x42CE102CUL))
#define bFM3_ETHERNET_MAC1_MAR8H_A44           *((volatile unsigned int*)(0x42CE1030UL))
#define bFM3_ETHERNET_MAC1_MAR8H_A45           *((volatile unsigned int*)(0x42CE1034UL))
#define bFM3_ETHERNET_MAC1_MAR8H_A46           *((volatile unsigned int*)(0x42CE1038UL))
#define bFM3_ETHERNET_MAC1_MAR8H_A47           *((volatile unsigned int*)(0x42CE103CUL))
#define bFM3_ETHERNET_MAC1_MAR8H_MBC0          *((volatile unsigned int*)(0x42CE1060UL))
#define bFM3_ETHERNET_MAC1_MAR8H_MBC1          *((volatile unsigned int*)(0x42CE1064UL))
#define bFM3_ETHERNET_MAC1_MAR8H_MBC2          *((volatile unsigned int*)(0x42CE1068UL))
#define bFM3_ETHERNET_MAC1_MAR8H_MBC3          *((volatile unsigned int*)(0x42CE106CUL))
#define bFM3_ETHERNET_MAC1_MAR8H_MBC4          *((volatile unsigned int*)(0x42CE1070UL))
#define bFM3_ETHERNET_MAC1_MAR8H_MBC5          *((volatile unsigned int*)(0x42CE1074UL))
#define bFM3_ETHERNET_MAC1_MAR8H_SA            *((volatile unsigned int*)(0x42CE1078UL))
#define bFM3_ETHERNET_MAC1_MAR8H_AE            *((volatile unsigned int*)(0x42CE107CUL))
#define bFM3_ETHERNET_MAC1_MAR8L_A0            *((volatile unsigned int*)(0x42CE1080UL))
#define bFM3_ETHERNET_MAC1_MAR8L_A1            *((volatile unsigned int*)(0x42CE1084UL))
#define bFM3_ETHERNET_MAC1_MAR8L_A2            *((volatile unsigned int*)(0x42CE1088UL))
#define bFM3_ETHERNET_MAC1_MAR8L_A3            *((volatile unsigned int*)(0x42CE108CUL))
#define bFM3_ETHERNET_MAC1_MAR8L_A4            *((volatile unsigned int*)(0x42CE1090UL))
#define bFM3_ETHERNET_MAC1_MAR8L_A5            *((volatile unsigned int*)(0x42CE1094UL))
#define bFM3_ETHERNET_MAC1_MAR8L_A6            *((volatile unsigned int*)(0x42CE1098UL))
#define bFM3_ETHERNET_MAC1_MAR8L_A7            *((volatile unsigned int*)(0x42CE109CUL))
#define bFM3_ETHERNET_MAC1_MAR8L_A8            *((volatile unsigned int*)(0x42CE10A0UL))
#define bFM3_ETHERNET_MAC1_MAR8L_A9            *((volatile unsigned int*)(0x42CE10A4UL))
#define bFM3_ETHERNET_MAC1_MAR8L_A10           *((volatile unsigned int*)(0x42CE10A8UL))
#define bFM3_ETHERNET_MAC1_MAR8L_A11           *((volatile unsigned int*)(0x42CE10ACUL))
#define bFM3_ETHERNET_MAC1_MAR8L_A12           *((volatile unsigned int*)(0x42CE10B0UL))
#define bFM3_ETHERNET_MAC1_MAR8L_A13           *((volatile unsigned int*)(0x42CE10B4UL))
#define bFM3_ETHERNET_MAC1_MAR8L_A14           *((volatile unsigned int*)(0x42CE10B8UL))
#define bFM3_ETHERNET_MAC1_MAR8L_A15           *((volatile unsigned int*)(0x42CE10BCUL))
#define bFM3_ETHERNET_MAC1_MAR8L_A16           *((volatile unsigned int*)(0x42CE10C0UL))
#define bFM3_ETHERNET_MAC1_MAR8L_A17           *((volatile unsigned int*)(0x42CE10C4UL))
#define bFM3_ETHERNET_MAC1_MAR8L_A18           *((volatile unsigned int*)(0x42CE10C8UL))
#define bFM3_ETHERNET_MAC1_MAR8L_A19           *((volatile unsigned int*)(0x42CE10CCUL))
#define bFM3_ETHERNET_MAC1_MAR8L_A20           *((volatile unsigned int*)(0x42CE10D0UL))
#define bFM3_ETHERNET_MAC1_MAR8L_A21           *((volatile unsigned int*)(0x42CE10D4UL))
#define bFM3_ETHERNET_MAC1_MAR8L_A22           *((volatile unsigned int*)(0x42CE10D8UL))
#define bFM3_ETHERNET_MAC1_MAR8L_A23           *((volatile unsigned int*)(0x42CE10DCUL))
#define bFM3_ETHERNET_MAC1_MAR8L_A24           *((volatile unsigned int*)(0x42CE10E0UL))
#define bFM3_ETHERNET_MAC1_MAR8L_A25           *((volatile unsigned int*)(0x42CE10E4UL))
#define bFM3_ETHERNET_MAC1_MAR8L_A26           *((volatile unsigned int*)(0x42CE10E8UL))
#define bFM3_ETHERNET_MAC1_MAR8L_A27           *((volatile unsigned int*)(0x42CE10ECUL))
#define bFM3_ETHERNET_MAC1_MAR8L_A28           *((volatile unsigned int*)(0x42CE10F0UL))
#define bFM3_ETHERNET_MAC1_MAR8L_A29           *((volatile unsigned int*)(0x42CE10F4UL))
#define bFM3_ETHERNET_MAC1_MAR8L_A30           *((volatile unsigned int*)(0x42CE10F8UL))
#define bFM3_ETHERNET_MAC1_MAR8L_A31           *((volatile unsigned int*)(0x42CE10FCUL))
#define bFM3_ETHERNET_MAC1_MAR9H_A32           *((volatile unsigned int*)(0x42CE1100UL))
#define bFM3_ETHERNET_MAC1_MAR9H_A33           *((volatile unsigned int*)(0x42CE1104UL))
#define bFM3_ETHERNET_MAC1_MAR9H_A34           *((volatile unsigned int*)(0x42CE1108UL))
#define bFM3_ETHERNET_MAC1_MAR9H_A35           *((volatile unsigned int*)(0x42CE110CUL))
#define bFM3_ETHERNET_MAC1_MAR9H_A36           *((volatile unsigned int*)(0x42CE1110UL))
#define bFM3_ETHERNET_MAC1_MAR9H_A37           *((volatile unsigned int*)(0x42CE1114UL))
#define bFM3_ETHERNET_MAC1_MAR9H_A38           *((volatile unsigned int*)(0x42CE1118UL))
#define bFM3_ETHERNET_MAC1_MAR9H_A39           *((volatile unsigned int*)(0x42CE111CUL))
#define bFM3_ETHERNET_MAC1_MAR9H_A40           *((volatile unsigned int*)(0x42CE1120UL))
#define bFM3_ETHERNET_MAC1_MAR9H_A41           *((volatile unsigned int*)(0x42CE1124UL))
#define bFM3_ETHERNET_MAC1_MAR9H_A42           *((volatile unsigned int*)(0x42CE1128UL))
#define bFM3_ETHERNET_MAC1_MAR9H_A43           *((volatile unsigned int*)(0x42CE112CUL))
#define bFM3_ETHERNET_MAC1_MAR9H_A44           *((volatile unsigned int*)(0x42CE1130UL))
#define bFM3_ETHERNET_MAC1_MAR9H_A45           *((volatile unsigned int*)(0x42CE1134UL))
#define bFM3_ETHERNET_MAC1_MAR9H_A46           *((volatile unsigned int*)(0x42CE1138UL))
#define bFM3_ETHERNET_MAC1_MAR9H_A47           *((volatile unsigned int*)(0x42CE113CUL))
#define bFM3_ETHERNET_MAC1_MAR9H_MBC0          *((volatile unsigned int*)(0x42CE1160UL))
#define bFM3_ETHERNET_MAC1_MAR9H_MBC1          *((volatile unsigned int*)(0x42CE1164UL))
#define bFM3_ETHERNET_MAC1_MAR9H_MBC2          *((volatile unsigned int*)(0x42CE1168UL))
#define bFM3_ETHERNET_MAC1_MAR9H_MBC3          *((volatile unsigned int*)(0x42CE116CUL))
#define bFM3_ETHERNET_MAC1_MAR9H_MBC4          *((volatile unsigned int*)(0x42CE1170UL))
#define bFM3_ETHERNET_MAC1_MAR9H_MBC5          *((volatile unsigned int*)(0x42CE1174UL))
#define bFM3_ETHERNET_MAC1_MAR9H_SA            *((volatile unsigned int*)(0x42CE1178UL))
#define bFM3_ETHERNET_MAC1_MAR9H_AE            *((volatile unsigned int*)(0x42CE117CUL))
#define bFM3_ETHERNET_MAC1_MAR9L_A0            *((volatile unsigned int*)(0x42CE1180UL))
#define bFM3_ETHERNET_MAC1_MAR9L_A1            *((volatile unsigned int*)(0x42CE1184UL))
#define bFM3_ETHERNET_MAC1_MAR9L_A2            *((volatile unsigned int*)(0x42CE1188UL))
#define bFM3_ETHERNET_MAC1_MAR9L_A3            *((volatile unsigned int*)(0x42CE118CUL))
#define bFM3_ETHERNET_MAC1_MAR9L_A4            *((volatile unsigned int*)(0x42CE1190UL))
#define bFM3_ETHERNET_MAC1_MAR9L_A5            *((volatile unsigned int*)(0x42CE1194UL))
#define bFM3_ETHERNET_MAC1_MAR9L_A6            *((volatile unsigned int*)(0x42CE1198UL))
#define bFM3_ETHERNET_MAC1_MAR9L_A7            *((volatile unsigned int*)(0x42CE119CUL))
#define bFM3_ETHERNET_MAC1_MAR9L_A8            *((volatile unsigned int*)(0x42CE11A0UL))
#define bFM3_ETHERNET_MAC1_MAR9L_A9            *((volatile unsigned int*)(0x42CE11A4UL))
#define bFM3_ETHERNET_MAC1_MAR9L_A10           *((volatile unsigned int*)(0x42CE11A8UL))
#define bFM3_ETHERNET_MAC1_MAR9L_A11           *((volatile unsigned int*)(0x42CE11ACUL))
#define bFM3_ETHERNET_MAC1_MAR9L_A12           *((volatile unsigned int*)(0x42CE11B0UL))
#define bFM3_ETHERNET_MAC1_MAR9L_A13           *((volatile unsigned int*)(0x42CE11B4UL))
#define bFM3_ETHERNET_MAC1_MAR9L_A14           *((volatile unsigned int*)(0x42CE11B8UL))
#define bFM3_ETHERNET_MAC1_MAR9L_A15           *((volatile unsigned int*)(0x42CE11BCUL))
#define bFM3_ETHERNET_MAC1_MAR9L_A16           *((volatile unsigned int*)(0x42CE11C0UL))
#define bFM3_ETHERNET_MAC1_MAR9L_A17           *((volatile unsigned int*)(0x42CE11C4UL))
#define bFM3_ETHERNET_MAC1_MAR9L_A18           *((volatile unsigned int*)(0x42CE11C8UL))
#define bFM3_ETHERNET_MAC1_MAR9L_A19           *((volatile unsigned int*)(0x42CE11CCUL))
#define bFM3_ETHERNET_MAC1_MAR9L_A20           *((volatile unsigned int*)(0x42CE11D0UL))
#define bFM3_ETHERNET_MAC1_MAR9L_A21           *((volatile unsigned int*)(0x42CE11D4UL))
#define bFM3_ETHERNET_MAC1_MAR9L_A22           *((volatile unsigned int*)(0x42CE11D8UL))
#define bFM3_ETHERNET_MAC1_MAR9L_A23           *((volatile unsigned int*)(0x42CE11DCUL))
#define bFM3_ETHERNET_MAC1_MAR9L_A24           *((volatile unsigned int*)(0x42CE11E0UL))
#define bFM3_ETHERNET_MAC1_MAR9L_A25           *((volatile unsigned int*)(0x42CE11E4UL))
#define bFM3_ETHERNET_MAC1_MAR9L_A26           *((volatile unsigned int*)(0x42CE11E8UL))
