RT-Thread/rt-thread/bsp/mb9bf618s/CMSIS/DeviceSupport/fujitsu/mb9bf61x/mb9b610s.h
#define bFM3_ETHERNET_MAC1_MAR9L_A27           *((volatile unsigned int*)(0x42CE11ECUL))
#define bFM3_ETHERNET_MAC1_MAR9L_A28           *((volatile unsigned int*)(0x42CE11F0UL))
#define bFM3_ETHERNET_MAC1_MAR9L_A29           *((volatile unsigned int*)(0x42CE11F4UL))
#define bFM3_ETHERNET_MAC1_MAR9L_A30           *((volatile unsigned int*)(0x42CE11F8UL))
#define bFM3_ETHERNET_MAC1_MAR9L_A31           *((volatile unsigned int*)(0x42CE11FCUL))
#define bFM3_ETHERNET_MAC1_MAR10H_A32          *((volatile unsigned int*)(0x42CE1200UL))
#define bFM3_ETHERNET_MAC1_MAR10H_A33          *((volatile unsigned int*)(0x42CE1204UL))
#define bFM3_ETHERNET_MAC1_MAR10H_A34          *((volatile unsigned int*)(0x42CE1208UL))
#define bFM3_ETHERNET_MAC1_MAR10H_A35          *((volatile unsigned int*)(0x42CE120CUL))
#define bFM3_ETHERNET_MAC1_MAR10H_A36          *((volatile unsigned int*)(0x42CE1210UL))
#define bFM3_ETHERNET_MAC1_MAR10H_A37          *((volatile unsigned int*)(0x42CE1214UL))
#define bFM3_ETHERNET_MAC1_MAR10H_A38          *((volatile unsigned int*)(0x42CE1218UL))
#define bFM3_ETHERNET_MAC1_MAR10H_A39          *((volatile unsigned int*)(0x42CE121CUL))
#define bFM3_ETHERNET_MAC1_MAR10H_A40          *((volatile unsigned int*)(0x42CE1220UL))
#define bFM3_ETHERNET_MAC1_MAR10H_A41          *((volatile unsigned int*)(0x42CE1224UL))
#define bFM3_ETHERNET_MAC1_MAR10H_A42          *((volatile unsigned int*)(0x42CE1228UL))
#define bFM3_ETHERNET_MAC1_MAR10H_A43          *((volatile unsigned int*)(0x42CE122CUL))
#define bFM3_ETHERNET_MAC1_MAR10H_A44          *((volatile unsigned int*)(0x42CE1230UL))
#define bFM3_ETHERNET_MAC1_MAR10H_A45          *((volatile unsigned int*)(0x42CE1234UL))
#define bFM3_ETHERNET_MAC1_MAR10H_A46          *((volatile unsigned int*)(0x42CE1238UL))
#define bFM3_ETHERNET_MAC1_MAR10H_A47          *((volatile unsigned int*)(0x42CE123CUL))
#define bFM3_ETHERNET_MAC1_MAR10H_MBC0         *((volatile unsigned int*)(0x42CE1260UL))
#define bFM3_ETHERNET_MAC1_MAR10H_MBC1         *((volatile unsigned int*)(0x42CE1264UL))
#define bFM3_ETHERNET_MAC1_MAR10H_MBC2         *((volatile unsigned int*)(0x42CE1268UL))
#define bFM3_ETHERNET_MAC1_MAR10H_MBC3         *((volatile unsigned int*)(0x42CE126CUL))
#define bFM3_ETHERNET_MAC1_MAR10H_MBC4         *((volatile unsigned int*)(0x42CE1270UL))
#define bFM3_ETHERNET_MAC1_MAR10H_MBC5         *((volatile unsigned int*)(0x42CE1274UL))
#define bFM3_ETHERNET_MAC1_MAR10H_SA           *((volatile unsigned int*)(0x42CE1278UL))
#define bFM3_ETHERNET_MAC1_MAR10H_AE           *((volatile unsigned int*)(0x42CE127CUL))
#define bFM3_ETHERNET_MAC1_MAR10L_A0           *((volatile unsigned int*)(0x42CE1280UL))
#define bFM3_ETHERNET_MAC1_MAR10L_A1           *((volatile unsigned int*)(0x42CE1284UL))
#define bFM3_ETHERNET_MAC1_MAR10L_A2           *((volatile unsigned int*)(0x42CE1288UL))
#define bFM3_ETHERNET_MAC1_MAR10L_A3           *((volatile unsigned int*)(0x42CE128CUL))
#define bFM3_ETHERNET_MAC1_MAR10L_A4           *((volatile unsigned int*)(0x42CE1290UL))
#define bFM3_ETHERNET_MAC1_MAR10L_A5           *((volatile unsigned int*)(0x42CE1294UL))
#define bFM3_ETHERNET_MAC1_MAR10L_A6           *((volatile unsigned int*)(0x42CE1298UL))
#define bFM3_ETHERNET_MAC1_MAR10L_A7           *((volatile unsigned int*)(0x42CE129CUL))
#define bFM3_ETHERNET_MAC1_MAR10L_A8           *((volatile unsigned int*)(0x42CE12A0UL))
#define bFM3_ETHERNET_MAC1_MAR10L_A9           *((volatile unsigned int*)(0x42CE12A4UL))
#define bFM3_ETHERNET_MAC1_MAR10L_A10          *((volatile unsigned int*)(0x42CE12A8UL))
#define bFM3_ETHERNET_MAC1_MAR10L_A11          *((volatile unsigned int*)(0x42CE12ACUL))
#define bFM3_ETHERNET_MAC1_MAR10L_A12          *((volatile unsigned int*)(0x42CE12B0UL))
#define bFM3_ETHERNET_MAC1_MAR10L_A13          *((volatile unsigned int*)(0x42CE12B4UL))
#define bFM3_ETHERNET_MAC1_MAR10L_A14          *((volatile unsigned int*)(0x42CE12B8UL))
#define bFM3_ETHERNET_MAC1_MAR10L_A15          *((volatile unsigned int*)(0x42CE12BCUL))
#define bFM3_ETHERNET_MAC1_MAR10L_A16          *((volatile unsigned int*)(0x42CE12C0UL))
#define bFM3_ETHERNET_MAC1_MAR10L_A17          *((volatile unsigned int*)(0x42CE12C4UL))
#define bFM3_ETHERNET_MAC1_MAR10L_A18          *((volatile unsigned int*)(0x42CE12C8UL))
#define bFM3_ETHERNET_MAC1_MAR10L_A19          *((volatile unsigned int*)(0x42CE12CCUL))
#define bFM3_ETHERNET_MAC1_MAR10L_A20          *((volatile unsigned int*)(0x42CE12D0UL))
#define bFM3_ETHERNET_MAC1_MAR10L_A21          *((volatile unsigned int*)(0x42CE12D4UL))
#define bFM3_ETHERNET_MAC1_MAR10L_A22          *((volatile unsigned int*)(0x42CE12D8UL))
#define bFM3_ETHERNET_MAC1_MAR10L_A23          *((volatile unsigned int*)(0x42CE12DCUL))
#define bFM3_ETHERNET_MAC1_MAR10L_A24          *((volatile unsigned int*)(0x42CE12E0UL))
#define bFM3_ETHERNET_MAC1_MAR10L_A25          *((volatile unsigned int*)(0x42CE12E4UL))
#define bFM3_ETHERNET_MAC1_MAR10L_A26          *((volatile unsigned int*)(0x42CE12E8UL))
#define bFM3_ETHERNET_MAC1_MAR10L_A27          *((volatile unsigned int*)(0x42CE12ECUL))
#define bFM3_ETHERNET_MAC1_MAR10L_A28          *((volatile unsigned int*)(0x42CE12F0UL))
#define bFM3_ETHERNET_MAC1_MAR10L_A29          *((volatile unsigned int*)(0x42CE12F4UL))
#define bFM3_ETHERNET_MAC1_MAR10L_A30          *((volatile unsigned int*)(0x42CE12F8UL))
#define bFM3_ETHERNET_MAC1_MAR10L_A31          *((volatile unsigned int*)(0x42CE12FCUL))
#define bFM3_ETHERNET_MAC1_MAR11H_A32          *((volatile unsigned int*)(0x42CE1300UL))
#define bFM3_ETHERNET_MAC1_MAR11H_A33          *((volatile unsigned int*)(0x42CE1304UL))
#define bFM3_ETHERNET_MAC1_MAR11H_A34          *((volatile unsigned int*)(0x42CE1308UL))
#define bFM3_ETHERNET_MAC1_MAR11H_A35          *((volatile unsigned int*)(0x42CE130CUL))
#define bFM3_ETHERNET_MAC1_MAR11H_A36          *((volatile unsigned int*)(0x42CE1310UL))
#define bFM3_ETHERNET_MAC1_MAR11H_A37          *((volatile unsigned int*)(0x42CE1314UL))
#define bFM3_ETHERNET_MAC1_MAR11H_A38          *((volatile unsigned int*)(0x42CE1318UL))
#define bFM3_ETHERNET_MAC1_MAR11H_A39          *((volatile unsigned int*)(0x42CE131CUL))
#define bFM3_ETHERNET_MAC1_MAR11H_A40          *((volatile unsigned int*)(0x42CE1320UL))
#define bFM3_ETHERNET_MAC1_MAR11H_A41          *((volatile unsigned int*)(0x42CE1324UL))
#define bFM3_ETHERNET_MAC1_MAR11H_A42          *((volatile unsigned int*)(0x42CE1328UL))
#define bFM3_ETHERNET_MAC1_MAR11H_A43          *((volatile unsigned int*)(0x42CE132CUL))
#define bFM3_ETHERNET_MAC1_MAR11H_A44          *((volatile unsigned int*)(0x42CE1330UL))
#define bFM3_ETHERNET_MAC1_MAR11H_A45          *((volatile unsigned int*)(0x42CE1334UL))
#define bFM3_ETHERNET_MAC1_MAR11H_A46          *((volatile unsigned int*)(0x42CE1338UL))
#define bFM3_ETHERNET_MAC1_MAR11H_A47          *((volatile unsigned int*)(0x42CE133CUL))
#define bFM3_ETHERNET_MAC1_MAR11H_MBC0         *((volatile unsigned int*)(0x42CE1360UL))
#define bFM3_ETHERNET_MAC1_MAR11H_MBC1         *((volatile unsigned int*)(0x42CE1364UL))
#define bFM3_ETHERNET_MAC1_MAR11H_MBC2         *((volatile unsigned int*)(0x42CE1368UL))
#define bFM3_ETHERNET_MAC1_MAR11H_MBC3         *((volatile unsigned int*)(0x42CE136CUL))
#define bFM3_ETHERNET_MAC1_MAR11H_MBC4         *((volatile unsigned int*)(0x42CE1370UL))
#define bFM3_ETHERNET_MAC1_MAR11H_MBC5         *((volatile unsigned int*)(0x42CE1374UL))
#define bFM3_ETHERNET_MAC1_MAR11H_SA           *((volatile unsigned int*)(0x42CE1378UL))
#define bFM3_ETHERNET_MAC1_MAR11H_AE           *((volatile unsigned int*)(0x42CE137CUL))
#define bFM3_ETHERNET_MAC1_MAR11L_A0           *((volatile unsigned int*)(0x42CE1380UL))
#define bFM3_ETHERNET_MAC1_MAR11L_A1           *((volatile unsigned int*)(0x42CE1384UL))
#define bFM3_ETHERNET_MAC1_MAR11L_A2           *((volatile unsigned int*)(0x42CE1388UL))
#define bFM3_ETHERNET_MAC1_MAR11L_A3           *((volatile unsigned int*)(0x42CE138CUL))
#define bFM3_ETHERNET_MAC1_MAR11L_A4           *((volatile unsigned int*)(0x42CE1390UL))
#define bFM3_ETHERNET_MAC1_MAR11L_A5           *((volatile unsigned int*)(0x42CE1394UL))
#define bFM3_ETHERNET_MAC1_MAR11L_A6           *((volatile unsigned int*)(0x42CE1398UL))
#define bFM3_ETHERNET_MAC1_MAR11L_A7           *((volatile unsigned int*)(0x42CE139CUL))
#define bFM3_ETHERNET_MAC1_MAR11L_A8           *((volatile unsigned int*)(0x42CE13A0UL))
#define bFM3_ETHERNET_MAC1_MAR11L_A9           *((volatile unsigned int*)(0x42CE13A4UL))
#define bFM3_ETHERNET_MAC1_MAR11L_A10          *((volatile unsigned int*)(0x42CE13A8UL))
#define bFM3_ETHERNET_MAC1_MAR11L_A11          *((volatile unsigned int*)(0x42CE13ACUL))
#define bFM3_ETHERNET_MAC1_MAR11L_A12          *((volatile unsigned int*)(0x42CE13B0UL))
#define bFM3_ETHERNET_MAC1_MAR11L_A13          *((volatile unsigned int*)(0x42CE13B4UL))
#define bFM3_ETHERNET_MAC1_MAR11L_A14          *((volatile unsigned int*)(0x42CE13B8UL))
#define bFM3_ETHERNET_MAC1_MAR11L_A15          *((volatile unsigned int*)(0x42CE13BCUL))
#define bFM3_ETHERNET_MAC1_MAR11L_A16          *((volatile unsigned int*)(0x42CE13C0UL))
#define bFM3_ETHERNET_MAC1_MAR11L_A17          *((volatile unsigned int*)(0x42CE13C4UL))
#define bFM3_ETHERNET_MAC1_MAR11L_A18          *((volatile unsigned int*)(0x42CE13C8UL))
#define bFM3_ETHERNET_MAC1_MAR11L_A19          *((volatile unsigned int*)(0x42CE13CCUL))
#define bFM3_ETHERNET_MAC1_MAR11L_A20          *((volatile unsigned int*)(0x42CE13D0UL))
#define bFM3_ETHERNET_MAC1_MAR11L_A21          *((volatile unsigned int*)(0x42CE13D4UL))
#define bFM3_ETHERNET_MAC1_MAR11L_A22          *((volatile unsigned int*)(0x42CE13D8UL))
#define bFM3_ETHERNET_MAC1_MAR11L_A23          *((volatile unsigned int*)(0x42CE13DCUL))
#define bFM3_ETHERNET_MAC1_MAR11L_A24          *((volatile unsigned int*)(0x42CE13E0UL))
#define bFM3_ETHERNET_MAC1_MAR11L_A25          *((volatile unsigned int*)(0x42CE13E4UL))
#define bFM3_ETHERNET_MAC1_MAR11L_A26          *((volatile unsigned int*)(0x42CE13E8UL))
#define bFM3_ETHERNET_MAC1_MAR11L_A27          *((volatile unsigned int*)(0x42CE13ECUL))
#define bFM3_ETHERNET_MAC1_MAR11L_A28          *((volatile unsigned int*)(0x42CE13F0UL))
#define bFM3_ETHERNET_MAC1_MAR11L_A29          *((volatile unsigned int*)(0x42CE13F4UL))
#define bFM3_ETHERNET_MAC1_MAR11L_A30          *((volatile unsigned int*)(0x42CE13F8UL))
#define bFM3_ETHERNET_MAC1_MAR11L_A31          *((volatile unsigned int*)(0x42CE13FCUL))
#define bFM3_ETHERNET_MAC1_MAR12H_A32          *((volatile unsigned int*)(0x42CE1400UL))
#define bFM3_ETHERNET_MAC1_MAR12H_A33          *((volatile unsigned int*)(0x42CE1404UL))
#define bFM3_ETHERNET_MAC1_MAR12H_A34          *((volatile unsigned int*)(0x42CE1408UL))
#define bFM3_ETHERNET_MAC1_MAR12H_A35          *((volatile unsigned int*)(0x42CE140CUL))
#define bFM3_ETHERNET_MAC1_MAR12H_A36          *((volatile unsigned int*)(0x42CE1410UL))
#define bFM3_ETHERNET_MAC1_MAR12H_A37          *((volatile unsigned int*)(0x42CE1414UL))
#define bFM3_ETHERNET_MAC1_MAR12H_A38          *((volatile unsigned int*)(0x42CE1418UL))
#define bFM3_ETHERNET_MAC1_MAR12H_A39          *((volatile unsigned int*)(0x42CE141CUL))
#define bFM3_ETHERNET_MAC1_MAR12H_A40          *((volatile unsigned int*)(0x42CE1420UL))
#define bFM3_ETHERNET_MAC1_MAR12H_A41          *((volatile unsigned int*)(0x42CE1424UL))
#define bFM3_ETHERNET_MAC1_MAR12H_A42          *((volatile unsigned int*)(0x42CE1428UL))
#define bFM3_ETHERNET_MAC1_MAR12H_A43          *((volatile unsigned int*)(0x42CE142CUL))
#define bFM3_ETHERNET_MAC1_MAR12H_A44          *((volatile unsigned int*)(0x42CE1430UL))
#define bFM3_ETHERNET_MAC1_MAR12H_A45          *((volatile unsigned int*)(0x42CE1434UL))
#define bFM3_ETHERNET_MAC1_MAR12H_A46          *((volatile unsigned int*)(0x42CE1438UL))
#define bFM3_ETHERNET_MAC1_MAR12H_A47          *((volatile unsigned int*)(0x42CE143CUL))
#define bFM3_ETHERNET_MAC1_MAR12H_MBC0         *((volatile unsigned int*)(0x42CE1460UL))
#define bFM3_ETHERNET_MAC1_MAR12H_MBC1         *((volatile unsigned int*)(0x42CE1464UL))
#define bFM3_ETHERNET_MAC1_MAR12H_MBC2         *((volatile unsigned int*)(0x42CE1468UL))
#define bFM3_ETHERNET_MAC1_MAR12H_MBC3         *((volatile unsigned int*)(0x42CE146CUL))
#define bFM3_ETHERNET_MAC1_MAR12H_MBC4         *((volatile unsigned int*)(0x42CE1470UL))
#define bFM3_ETHERNET_MAC1_MAR12H_MBC5         *((volatile unsigned int*)(0x42CE1474UL))
#define bFM3_ETHERNET_MAC1_MAR12H_SA           *((volatile unsigned int*)(0x42CE1478UL))
#define bFM3_ETHERNET_MAC1_MAR12H_AE           *((volatile unsigned int*)(0x42CE147CUL))
#define bFM3_ETHERNET_MAC1_MAR12L_A0           *((volatile unsigned int*)(0x42CE1480UL))
#define bFM3_ETHERNET_MAC1_MAR12L_A1           *((volatile unsigned int*)(0x42CE1484UL))
#define bFM3_ETHERNET_MAC1_MAR12L_A2           *((volatile unsigned int*)(0x42CE1488UL))
#define bFM3_ETHERNET_MAC1_MAR12L_A3           *((volatile unsigned int*)(0x42CE148CUL))
#define bFM3_ETHERNET_MAC1_MAR12L_A4           *((volatile unsigned int*)(0x42CE1490UL))
#define bFM3_ETHERNET_MAC1_MAR12L_A5           *((volatile unsigned int*)(0x42CE1494UL))
#define bFM3_ETHERNET_MAC1_MAR12L_A6           *((volatile unsigned int*)(0x42CE1498UL))
#define bFM3_ETHERNET_MAC1_MAR12L_A7           *((volatile unsigned int*)(0x42CE149CUL))
#define bFM3_ETHERNET_MAC1_MAR12L_A8           *((volatile unsigned int*)(0x42CE14A0UL))
#define bFM3_ETHERNET_MAC1_MAR12L_A9           *((volatile unsigned int*)(0x42CE14A4UL))
#define bFM3_ETHERNET_MAC1_MAR12L_A10          *((volatile unsigned int*)(0x42CE14A8UL))
#define bFM3_ETHERNET_MAC1_MAR12L_A11          *((volatile unsigned int*)(0x42CE14ACUL))
#define bFM3_ETHERNET_MAC1_MAR12L_A12          *((volatile unsigned int*)(0x42CE14B0UL))
#define bFM3_ETHERNET_MAC1_MAR12L_A13          *((volatile unsigned int*)(0x42CE14B4UL))
#define bFM3_ETHERNET_MAC1_MAR12L_A14          *((volatile unsigned int*)(0x42CE14B8UL))
#define bFM3_ETHERNET_MAC1_MAR12L_A15          *((volatile unsigned int*)(0x42CE14BCUL))
#define bFM3_ETHERNET_MAC1_MAR12L_A16          *((volatile unsigned int*)(0x42CE14C0UL))
#define bFM3_ETHERNET_MAC1_MAR12L_A17          *((volatile unsigned int*)(0x42CE14C4UL))
#define bFM3_ETHERNET_MAC1_MAR12L_A18          *((volatile unsigned int*)(0x42CE14C8UL))
#define bFM3_ETHERNET_MAC1_MAR12L_A19          *((volatile unsigned int*)(0x42CE14CCUL))
#define bFM3_ETHERNET_MAC1_MAR12L_A20          *((volatile unsigned int*)(0x42CE14D0UL))
#define bFM3_ETHERNET_MAC1_MAR12L_A21          *((volatile unsigned int*)(0x42CE14D4UL))
#define bFM3_ETHERNET_MAC1_MAR12L_A22          *((volatile unsigned int*)(0x42CE14D8UL))
#define bFM3_ETHERNET_MAC1_MAR12L_A23          *((volatile unsigned int*)(0x42CE14DCUL))
#define bFM3_ETHERNET_MAC1_MAR12L_A24          *((volatile unsigned int*)(0x42CE14E0UL))
#define bFM3_ETHERNET_MAC1_MAR12L_A25          *((volatile unsigned int*)(0x42CE14E4UL))
#define bFM3_ETHERNET_MAC1_MAR12L_A26          *((volatile unsigned int*)(0x42CE14E8UL))
#define bFM3_ETHERNET_MAC1_MAR12L_A27          *((volatile unsigned int*)(0x42CE14ECUL))
#define bFM3_ETHERNET_MAC1_MAR12L_A28          *((volatile unsigned int*)(0x42CE14F0UL))
#define bFM3_ETHERNET_MAC1_MAR12L_A29          *((volatile unsigned int*)(0x42CE14F4UL))
#define bFM3_ETHERNET_MAC1_MAR12L_A30          *((volatile unsigned int*)(0x42CE14F8UL))
#define bFM3_ETHERNET_MAC1_MAR12L_A31          *((volatile unsigned int*)(0x42CE14FCUL))
#define bFM3_ETHERNET_MAC1_MAR13H_A32          *((volatile unsigned int*)(0x42CE1500UL))
#define bFM3_ETHERNET_MAC1_MAR13H_A33          *((volatile unsigned int*)(0x42CE1504UL))
#define bFM3_ETHERNET_MAC1_MAR13H_A34          *((volatile unsigned int*)(0x42CE1508UL))
#define bFM3_ETHERNET_MAC1_MAR13H_A35          *((volatile unsigned int*)(0x42CE150CUL))
#define bFM3_ETHERNET_MAC1_MAR13H_A36          *((volatile unsigned int*)(0x42CE1510UL))
#define bFM3_ETHERNET_MAC1_MAR13H_A37          *((volatile unsigned int*)(0x42CE1514UL))
#define bFM3_ETHERNET_MAC1_MAR13H_A38          *((volatile unsigned int*)(0x42CE1518UL))
#define bFM3_ETHERNET_MAC1_MAR13H_A39          *((volatile unsigned int*)(0x42CE151CUL))
#define bFM3_ETHERNET_MAC1_MAR13H_A40          *((volatile unsigned int*)(0x42CE1520UL))
#define bFM3_ETHERNET_MAC1_MAR13H_A41          *((volatile unsigned int*)(0x42CE1524UL))
#define bFM3_ETHERNET_MAC1_MAR13H_A42          *((volatile unsigned int*)(0x42CE1528UL))
#define bFM3_ETHERNET_MAC1_MAR13H_A43          *((volatile unsigned int*)(0x42CE152CUL))
#define bFM3_ETHERNET_MAC1_MAR13H_A44          *((volatile unsigned int*)(0x42CE1530UL))
#define bFM3_ETHERNET_MAC1_MAR13H_A45          *((volatile unsigned int*)(0x42CE1534UL))
#define bFM3_ETHERNET_MAC1_MAR13H_A46          *((volatile unsigned int*)(0x42CE1538UL))
#define bFM3_ETHERNET_MAC1_MAR13H_A47          *((volatile unsigned int*)(0x42CE153CUL))
#define bFM3_ETHERNET_MAC1_MAR13H_MBC0         *((volatile unsigned int*)(0x42CE1560UL))
#define bFM3_ETHERNET_MAC1_MAR13H_MBC1         *((volatile unsigned int*)(0x42CE1564UL))
#define bFM3_ETHERNET_MAC1_MAR13H_MBC2         *((volatile unsigned int*)(0x42CE1568UL))
#define bFM3_ETHERNET_MAC1_MAR13H_MBC3         *((volatile unsigned int*)(0x42CE156CUL))
#define bFM3_ETHERNET_MAC1_MAR13H_MBC4         *((volatile unsigned int*)(0x42CE1570UL))
#define bFM3_ETHERNET_MAC1_MAR13H_MBC5         *((volatile unsigned int*)(0x42CE1574UL))
#define bFM3_ETHERNET_MAC1_MAR13H_SA           *((volatile unsigned int*)(0x42CE1578UL))
#define bFM3_ETHERNET_MAC1_MAR13H_AE           *((volatile unsigned int*)(0x42CE157CUL))
#define bFM3_ETHERNET_MAC1_MAR13L_A0           *((volatile unsigned int*)(0x42CE1580UL))
#define bFM3_ETHERNET_MAC1_MAR13L_A1           *((volatile unsigned int*)(0x42CE1584UL))
#define bFM3_ETHERNET_MAC1_MAR13L_A2           *((volatile unsigned int*)(0x42CE1588UL))
#define bFM3_ETHERNET_MAC1_MAR13L_A3           *((volatile unsigned int*)(0x42CE158CUL))
#define bFM3_ETHERNET_MAC1_MAR13L_A4           *((volatile unsigned int*)(0x42CE1590UL))
#define bFM3_ETHERNET_MAC1_MAR13L_A5           *((volatile unsigned int*)(0x42CE1594UL))
#define bFM3_ETHERNET_MAC1_MAR13L_A6           *((volatile unsigned int*)(0x42CE1598UL))
#define bFM3_ETHERNET_MAC1_MAR13L_A7           *((volatile unsigned int*)(0x42CE159CUL))
#define bFM3_ETHERNET_MAC1_MAR13L_A8           *((volatile unsigned int*)(0x42CE15A0UL))
#define bFM3_ETHERNET_MAC1_MAR13L_A9           *((volatile unsigned int*)(0x42CE15A4UL))
#define bFM3_ETHERNET_MAC1_MAR13L_A10          *((volatile unsigned int*)(0x42CE15A8UL))
#define bFM3_ETHERNET_MAC1_MAR13L_A11          *((volatile unsigned int*)(0x42CE15ACUL))
#define bFM3_ETHERNET_MAC1_MAR13L_A12          *((volatile unsigned int*)(0x42CE15B0UL))
#define bFM3_ETHERNET_MAC1_MAR13L_A13          *((volatile unsigned int*)(0x42CE15B4UL))
#define bFM3_ETHERNET_MAC1_MAR13L_A14          *((volatile unsigned int*)(0x42CE15B8UL))
#define bFM3_ETHERNET_MAC1_MAR13L_A15          *((volatile unsigned int*)(0x42CE15BCUL))
#define bFM3_ETHERNET_MAC1_MAR13L_A16          *((volatile unsigned int*)(0x42CE15C0UL))
#define bFM3_ETHERNET_MAC1_MAR13L_A17          *((volatile unsigned int*)(0x42CE15C4UL))
#define bFM3_ETHERNET_MAC1_MAR13L_A18          *((volatile unsigned int*)(0x42CE15C8UL))
#define bFM3_ETHERNET_MAC1_MAR13L_A19          *((volatile unsigned int*)(0x42CE15CCUL))
#define bFM3_ETHERNET_MAC1_MAR13L_A20          *((volatile unsigned int*)(0x42CE15D0UL))
#define bFM3_ETHERNET_MAC1_MAR13L_A21          *((volatile unsigned int*)(0x42CE15D4UL))
#define bFM3_ETHERNET_MAC1_MAR13L_A22          *((volatile unsigned int*)(0x42CE15D8UL))
#define bFM3_ETHERNET_MAC1_MAR13L_A23          *((volatile unsigned int*)(0x42CE15DCUL))
#define bFM3_ETHERNET_MAC1_MAR13L_A24          *((volatile unsigned int*)(0x42CE15E0UL))
#define bFM3_ETHERNET_MAC1_MAR13L_A25          *((volatile unsigned int*)(0x42CE15E4UL))
#define bFM3_ETHERNET_MAC1_MAR13L_A26          *((volatile unsigned int*)(0x42CE15E8UL))
#define bFM3_ETHERNET_MAC1_MAR13L_A27          *((volatile unsigned int*)(0x42CE15ECUL))
#define bFM3_ETHERNET_MAC1_MAR13L_A28          *((volatile unsigned int*)(0x42CE15F0UL))
#define bFM3_ETHERNET_MAC1_MAR13L_A29          *((volatile unsigned int*)(0x42CE15F4UL))
#define bFM3_ETHERNET_MAC1_MAR13L_A30          *((volatile unsigned int*)(0x42CE15F8UL))
#define bFM3_ETHERNET_MAC1_MAR13L_A31          *((volatile unsigned int*)(0x42CE15FCUL))
#define bFM3_ETHERNET_MAC1_MAR14H_A32          *((volatile unsigned int*)(0x42CE1600UL))
#define bFM3_ETHERNET_MAC1_MAR14H_A33          *((volatile unsigned int*)(0x42CE1604UL))
#define bFM3_ETHERNET_MAC1_MAR14H_A34          *((volatile unsigned int*)(0x42CE1608UL))
#define bFM3_ETHERNET_MAC1_MAR14H_A35          *((volatile unsigned int*)(0x42CE160CUL))
#define bFM3_ETHERNET_MAC1_MAR14H_A36          *((volatile unsigned int*)(0x42CE1610UL))
#define bFM3_ETHERNET_MAC1_MAR14H_A37          *((volatile unsigned int*)(0x42CE1614UL))
#define bFM3_ETHERNET_MAC1_MAR14H_A38          *((volatile unsigned int*)(0x42CE1618UL))
#define bFM3_ETHERNET_MAC1_MAR14H_A39          *((volatile unsigned int*)(0x42CE161CUL))
#define bFM3_ETHERNET_MAC1_MAR14H_A40          *((volatile unsigned int*)(0x42CE1620UL))
#define bFM3_ETHERNET_MAC1_MAR14H_A41          *((volatile unsigned int*)(0x42CE1624UL))
#define bFM3_ETHERNET_MAC1_MAR14H_A42          *((volatile unsigned int*)(0x42CE1628UL))
#define bFM3_ETHERNET_MAC1_MAR14H_A43          *((volatile unsigned int*)(0x42CE162CUL))
#define bFM3_ETHERNET_MAC1_MAR14H_A44          *((volatile unsigned int*)(0x42CE1630UL))
#define bFM3_ETHERNET_MAC1_MAR14H_A45          *((volatile unsigned int*)(0x42CE1634UL))
#define bFM3_ETHERNET_MAC1_MAR14H_A46          *((volatile unsigned int*)(0x42CE1638UL))
#define bFM3_ETHERNET_MAC1_MAR14H_A47          *((volatile unsigned int*)(0x42CE163CUL))
#define bFM3_ETHERNET_MAC1_MAR14H_MBC0         *((volatile unsigned int*)(0x42CE1660UL))
#define bFM3_ETHERNET_MAC1_MAR14H_MBC1         *((volatile unsigned int*)(0x42CE1664UL))
#define bFM3_ETHERNET_MAC1_MAR14H_MBC2         *((volatile unsigned int*)(0x42CE1668UL))
#define bFM3_ETHERNET_MAC1_MAR14H_MBC3         *((volatile unsigned int*)(0x42CE166CUL))
#define bFM3_ETHERNET_MAC1_MAR14H_MBC4         *((volatile unsigned int*)(0x42CE1670UL))
#define bFM3_ETHERNET_MAC1_MAR14H_MBC5         *((volatile unsigned int*)(0x42CE1674UL))
#define bFM3_ETHERNET_MAC1_MAR14H_SA           *((volatile unsigned int*)(0x42CE1678UL))
#define bFM3_ETHERNET_MAC1_MAR14H_AE           *((volatile unsigned int*)(0x42CE167CUL))
#define bFM3_ETHERNET_MAC1_MAR14L_A0           *((volatile unsigned int*)(0x42CE1680UL))
#define bFM3_ETHERNET_MAC1_MAR14L_A1           *((volatile unsigned int*)(0x42CE1684UL))
#define bFM3_ETHERNET_MAC1_MAR14L_A2           *((volatile unsigned int*)(0x42CE1688UL))
#define bFM3_ETHERNET_MAC1_MAR14L_A3           *((volatile unsigned int*)(0x42CE168CUL))
#define bFM3_ETHERNET_MAC1_MAR14L_A4           *((volatile unsigned int*)(0x42CE1690UL))
#define bFM3_ETHERNET_MAC1_MAR14L_A5           *((volatile unsigned int*)(0x42CE1694UL))
#define bFM3_ETHERNET_MAC1_MAR14L_A6           *((volatile unsigned int*)(0x42CE1698UL))
#define bFM3_ETHERNET_MAC1_MAR14L_A7           *((volatile unsigned int*)(0x42CE169CUL))
#define bFM3_ETHERNET_MAC1_MAR14L_A8           *((volatile unsigned int*)(0x42CE16A0UL))
#define bFM3_ETHERNET_MAC1_MAR14L_A9           *((volatile unsigned int*)(0x42CE16A4UL))
#define bFM3_ETHERNET_MAC1_MAR14L_A10          *((volatile unsigned int*)(0x42CE16A8UL))
#define bFM3_ETHERNET_MAC1_MAR14L_A11          *((volatile unsigned int*)(0x42CE16ACUL))
#define bFM3_ETHERNET_MAC1_MAR14L_A12          *((volatile unsigned int*)(0x42CE16B0UL))
#define bFM3_ETHERNET_MAC1_MAR14L_A13          *((volatile unsigned int*)(0x42CE16B4UL))
#define bFM3_ETHERNET_MAC1_MAR14L_A14          *((volatile unsigned int*)(0x42CE16B8UL))
#define bFM3_ETHERNET_MAC1_MAR14L_A15          *((volatile unsigned int*)(0x42CE16BCUL))
