RT-Thread/rt-thread/bsp/mb9bf618s/CMSIS/DeviceSupport/fujitsu/mb9bf61x/mb9b610s.h
#define bFM3_ETHERNET_MAC1_MAR18H_A43          *((volatile unsigned int*)(0x42CF022CUL))
#define bFM3_ETHERNET_MAC1_MAR18H_A44          *((volatile unsigned int*)(0x42CF0230UL))
#define bFM3_ETHERNET_MAC1_MAR18H_A45          *((volatile unsigned int*)(0x42CF0234UL))
#define bFM3_ETHERNET_MAC1_MAR18H_A46          *((volatile unsigned int*)(0x42CF0238UL))
#define bFM3_ETHERNET_MAC1_MAR18H_A47          *((volatile unsigned int*)(0x42CF023CUL))
#define bFM3_ETHERNET_MAC1_MAR18H_MBC0         *((volatile unsigned int*)(0x42CF0260UL))
#define bFM3_ETHERNET_MAC1_MAR18H_MBC1         *((volatile unsigned int*)(0x42CF0264UL))
#define bFM3_ETHERNET_MAC1_MAR18H_MBC2         *((volatile unsigned int*)(0x42CF0268UL))
#define bFM3_ETHERNET_MAC1_MAR18H_MBC3         *((volatile unsigned int*)(0x42CF026CUL))
#define bFM3_ETHERNET_MAC1_MAR18H_MBC4         *((volatile unsigned int*)(0x42CF0270UL))
#define bFM3_ETHERNET_MAC1_MAR18H_MBC5         *((volatile unsigned int*)(0x42CF0274UL))
#define bFM3_ETHERNET_MAC1_MAR18H_SA           *((volatile unsigned int*)(0x42CF0278UL))
#define bFM3_ETHERNET_MAC1_MAR18H_AE           *((volatile unsigned int*)(0x42CF027CUL))
#define bFM3_ETHERNET_MAC1_MAR18L_A0           *((volatile unsigned int*)(0x42CF0280UL))
#define bFM3_ETHERNET_MAC1_MAR18L_A1           *((volatile unsigned int*)(0x42CF0284UL))
#define bFM3_ETHERNET_MAC1_MAR18L_A2           *((volatile unsigned int*)(0x42CF0288UL))
#define bFM3_ETHERNET_MAC1_MAR18L_A3           *((volatile unsigned int*)(0x42CF028CUL))
#define bFM3_ETHERNET_MAC1_MAR18L_A4           *((volatile unsigned int*)(0x42CF0290UL))
#define bFM3_ETHERNET_MAC1_MAR18L_A5           *((volatile unsigned int*)(0x42CF0294UL))
#define bFM3_ETHERNET_MAC1_MAR18L_A6           *((volatile unsigned int*)(0x42CF0298UL))
#define bFM3_ETHERNET_MAC1_MAR18L_A7           *((volatile unsigned int*)(0x42CF029CUL))
#define bFM3_ETHERNET_MAC1_MAR18L_A8           *((volatile unsigned int*)(0x42CF02A0UL))
#define bFM3_ETHERNET_MAC1_MAR18L_A9           *((volatile unsigned int*)(0x42CF02A4UL))
#define bFM3_ETHERNET_MAC1_MAR18L_A10          *((volatile unsigned int*)(0x42CF02A8UL))
#define bFM3_ETHERNET_MAC1_MAR18L_A11          *((volatile unsigned int*)(0x42CF02ACUL))
#define bFM3_ETHERNET_MAC1_MAR18L_A12          *((volatile unsigned int*)(0x42CF02B0UL))
#define bFM3_ETHERNET_MAC1_MAR18L_A13          *((volatile unsigned int*)(0x42CF02B4UL))
#define bFM3_ETHERNET_MAC1_MAR18L_A14          *((volatile unsigned int*)(0x42CF02B8UL))
#define bFM3_ETHERNET_MAC1_MAR18L_A15          *((volatile unsigned int*)(0x42CF02BCUL))
#define bFM3_ETHERNET_MAC1_MAR18L_A16          *((volatile unsigned int*)(0x42CF02C0UL))
#define bFM3_ETHERNET_MAC1_MAR18L_A17          *((volatile unsigned int*)(0x42CF02C4UL))
#define bFM3_ETHERNET_MAC1_MAR18L_A18          *((volatile unsigned int*)(0x42CF02C8UL))
#define bFM3_ETHERNET_MAC1_MAR18L_A19          *((volatile unsigned int*)(0x42CF02CCUL))
#define bFM3_ETHERNET_MAC1_MAR18L_A20          *((volatile unsigned int*)(0x42CF02D0UL))
#define bFM3_ETHERNET_MAC1_MAR18L_A21          *((volatile unsigned int*)(0x42CF02D4UL))
#define bFM3_ETHERNET_MAC1_MAR18L_A22          *((volatile unsigned int*)(0x42CF02D8UL))
#define bFM3_ETHERNET_MAC1_MAR18L_A23          *((volatile unsigned int*)(0x42CF02DCUL))
#define bFM3_ETHERNET_MAC1_MAR18L_A24          *((volatile unsigned int*)(0x42CF02E0UL))
#define bFM3_ETHERNET_MAC1_MAR18L_A25          *((volatile unsigned int*)(0x42CF02E4UL))
#define bFM3_ETHERNET_MAC1_MAR18L_A26          *((volatile unsigned int*)(0x42CF02E8UL))
#define bFM3_ETHERNET_MAC1_MAR18L_A27          *((volatile unsigned int*)(0x42CF02ECUL))
#define bFM3_ETHERNET_MAC1_MAR18L_A28          *((volatile unsigned int*)(0x42CF02F0UL))
#define bFM3_ETHERNET_MAC1_MAR18L_A29          *((volatile unsigned int*)(0x42CF02F4UL))
#define bFM3_ETHERNET_MAC1_MAR18L_A30          *((volatile unsigned int*)(0x42CF02F8UL))
#define bFM3_ETHERNET_MAC1_MAR18L_A31          *((volatile unsigned int*)(0x42CF02FCUL))
#define bFM3_ETHERNET_MAC1_MAR19H_A32          *((volatile unsigned int*)(0x42CF0300UL))
#define bFM3_ETHERNET_MAC1_MAR19H_A33          *((volatile unsigned int*)(0x42CF0304UL))
#define bFM3_ETHERNET_MAC1_MAR19H_A34          *((volatile unsigned int*)(0x42CF0308UL))
#define bFM3_ETHERNET_MAC1_MAR19H_A35          *((volatile unsigned int*)(0x42CF030CUL))
#define bFM3_ETHERNET_MAC1_MAR19H_A36          *((volatile unsigned int*)(0x42CF0310UL))
#define bFM3_ETHERNET_MAC1_MAR19H_A37          *((volatile unsigned int*)(0x42CF0314UL))
#define bFM3_ETHERNET_MAC1_MAR19H_A38          *((volatile unsigned int*)(0x42CF0318UL))
#define bFM3_ETHERNET_MAC1_MAR19H_A39          *((volatile unsigned int*)(0x42CF031CUL))
#define bFM3_ETHERNET_MAC1_MAR19H_A40          *((volatile unsigned int*)(0x42CF0320UL))
#define bFM3_ETHERNET_MAC1_MAR19H_A41          *((volatile unsigned int*)(0x42CF0324UL))
#define bFM3_ETHERNET_MAC1_MAR19H_A42          *((volatile unsigned int*)(0x42CF0328UL))
#define bFM3_ETHERNET_MAC1_MAR19H_A43          *((volatile unsigned int*)(0x42CF032CUL))
#define bFM3_ETHERNET_MAC1_MAR19H_A44          *((volatile unsigned int*)(0x42CF0330UL))
#define bFM3_ETHERNET_MAC1_MAR19H_A45          *((volatile unsigned int*)(0x42CF0334UL))
#define bFM3_ETHERNET_MAC1_MAR19H_A46          *((volatile unsigned int*)(0x42CF0338UL))
#define bFM3_ETHERNET_MAC1_MAR19H_A47          *((volatile unsigned int*)(0x42CF033CUL))
#define bFM3_ETHERNET_MAC1_MAR19H_MBC0         *((volatile unsigned int*)(0x42CF0360UL))
#define bFM3_ETHERNET_MAC1_MAR19H_MBC1         *((volatile unsigned int*)(0x42CF0364UL))
#define bFM3_ETHERNET_MAC1_MAR19H_MBC2         *((volatile unsigned int*)(0x42CF0368UL))
#define bFM3_ETHERNET_MAC1_MAR19H_MBC3         *((volatile unsigned int*)(0x42CF036CUL))
#define bFM3_ETHERNET_MAC1_MAR19H_MBC4         *((volatile unsigned int*)(0x42CF0370UL))
#define bFM3_ETHERNET_MAC1_MAR19H_MBC5         *((volatile unsigned int*)(0x42CF0374UL))
#define bFM3_ETHERNET_MAC1_MAR19H_SA           *((volatile unsigned int*)(0x42CF0378UL))
#define bFM3_ETHERNET_MAC1_MAR19H_AE           *((volatile unsigned int*)(0x42CF037CUL))
#define bFM3_ETHERNET_MAC1_MAR19L_A0           *((volatile unsigned int*)(0x42CF0380UL))
#define bFM3_ETHERNET_MAC1_MAR19L_A1           *((volatile unsigned int*)(0x42CF0384UL))
#define bFM3_ETHERNET_MAC1_MAR19L_A2           *((volatile unsigned int*)(0x42CF0388UL))
#define bFM3_ETHERNET_MAC1_MAR19L_A3           *((volatile unsigned int*)(0x42CF038CUL))
#define bFM3_ETHERNET_MAC1_MAR19L_A4           *((volatile unsigned int*)(0x42CF0390UL))
#define bFM3_ETHERNET_MAC1_MAR19L_A5           *((volatile unsigned int*)(0x42CF0394UL))
#define bFM3_ETHERNET_MAC1_MAR19L_A6           *((volatile unsigned int*)(0x42CF0398UL))
#define bFM3_ETHERNET_MAC1_MAR19L_A7           *((volatile unsigned int*)(0x42CF039CUL))
#define bFM3_ETHERNET_MAC1_MAR19L_A8           *((volatile unsigned int*)(0x42CF03A0UL))
#define bFM3_ETHERNET_MAC1_MAR19L_A9           *((volatile unsigned int*)(0x42CF03A4UL))
#define bFM3_ETHERNET_MAC1_MAR19L_A10          *((volatile unsigned int*)(0x42CF03A8UL))
#define bFM3_ETHERNET_MAC1_MAR19L_A11          *((volatile unsigned int*)(0x42CF03ACUL))
#define bFM3_ETHERNET_MAC1_MAR19L_A12          *((volatile unsigned int*)(0x42CF03B0UL))
#define bFM3_ETHERNET_MAC1_MAR19L_A13          *((volatile unsigned int*)(0x42CF03B4UL))
#define bFM3_ETHERNET_MAC1_MAR19L_A14          *((volatile unsigned int*)(0x42CF03B8UL))
#define bFM3_ETHERNET_MAC1_MAR19L_A15          *((volatile unsigned int*)(0x42CF03BCUL))
#define bFM3_ETHERNET_MAC1_MAR19L_A16          *((volatile unsigned int*)(0x42CF03C0UL))
#define bFM3_ETHERNET_MAC1_MAR19L_A17          *((volatile unsigned int*)(0x42CF03C4UL))
#define bFM3_ETHERNET_MAC1_MAR19L_A18          *((volatile unsigned int*)(0x42CF03C8UL))
#define bFM3_ETHERNET_MAC1_MAR19L_A19          *((volatile unsigned int*)(0x42CF03CCUL))
#define bFM3_ETHERNET_MAC1_MAR19L_A20          *((volatile unsigned int*)(0x42CF03D0UL))
#define bFM3_ETHERNET_MAC1_MAR19L_A21          *((volatile unsigned int*)(0x42CF03D4UL))
#define bFM3_ETHERNET_MAC1_MAR19L_A22          *((volatile unsigned int*)(0x42CF03D8UL))
#define bFM3_ETHERNET_MAC1_MAR19L_A23          *((volatile unsigned int*)(0x42CF03DCUL))
#define bFM3_ETHERNET_MAC1_MAR19L_A24          *((volatile unsigned int*)(0x42CF03E0UL))
#define bFM3_ETHERNET_MAC1_MAR19L_A25          *((volatile unsigned int*)(0x42CF03E4UL))
#define bFM3_ETHERNET_MAC1_MAR19L_A26          *((volatile unsigned int*)(0x42CF03E8UL))
#define bFM3_ETHERNET_MAC1_MAR19L_A27          *((volatile unsigned int*)(0x42CF03ECUL))
#define bFM3_ETHERNET_MAC1_MAR19L_A28          *((volatile unsigned int*)(0x42CF03F0UL))
#define bFM3_ETHERNET_MAC1_MAR19L_A29          *((volatile unsigned int*)(0x42CF03F4UL))
#define bFM3_ETHERNET_MAC1_MAR19L_A30          *((volatile unsigned int*)(0x42CF03F8UL))
#define bFM3_ETHERNET_MAC1_MAR19L_A31          *((volatile unsigned int*)(0x42CF03FCUL))
#define bFM3_ETHERNET_MAC1_MAR20H_A32          *((volatile unsigned int*)(0x42CF0400UL))
#define bFM3_ETHERNET_MAC1_MAR20H_A33          *((volatile unsigned int*)(0x42CF0404UL))
#define bFM3_ETHERNET_MAC1_MAR20H_A34          *((volatile unsigned int*)(0x42CF0408UL))
#define bFM3_ETHERNET_MAC1_MAR20H_A35          *((volatile unsigned int*)(0x42CF040CUL))
#define bFM3_ETHERNET_MAC1_MAR20H_A36          *((volatile unsigned int*)(0x42CF0410UL))
#define bFM3_ETHERNET_MAC1_MAR20H_A37          *((volatile unsigned int*)(0x42CF0414UL))
#define bFM3_ETHERNET_MAC1_MAR20H_A38          *((volatile unsigned int*)(0x42CF0418UL))
#define bFM3_ETHERNET_MAC1_MAR20H_A39          *((volatile unsigned int*)(0x42CF041CUL))
#define bFM3_ETHERNET_MAC1_MAR20H_A40          *((volatile unsigned int*)(0x42CF0420UL))
#define bFM3_ETHERNET_MAC1_MAR20H_A41          *((volatile unsigned int*)(0x42CF0424UL))
#define bFM3_ETHERNET_MAC1_MAR20H_A42          *((volatile unsigned int*)(0x42CF0428UL))
#define bFM3_ETHERNET_MAC1_MAR20H_A43          *((volatile unsigned int*)(0x42CF042CUL))
#define bFM3_ETHERNET_MAC1_MAR20H_A44          *((volatile unsigned int*)(0x42CF0430UL))
#define bFM3_ETHERNET_MAC1_MAR20H_A45          *((volatile unsigned int*)(0x42CF0434UL))
#define bFM3_ETHERNET_MAC1_MAR20H_A46          *((volatile unsigned int*)(0x42CF0438UL))
#define bFM3_ETHERNET_MAC1_MAR20H_A47          *((volatile unsigned int*)(0x42CF043CUL))
#define bFM3_ETHERNET_MAC1_MAR20H_MBC0         *((volatile unsigned int*)(0x42CF0460UL))
#define bFM3_ETHERNET_MAC1_MAR20H_MBC1         *((volatile unsigned int*)(0x42CF0464UL))
#define bFM3_ETHERNET_MAC1_MAR20H_MBC2         *((volatile unsigned int*)(0x42CF0468UL))
#define bFM3_ETHERNET_MAC1_MAR20H_MBC3         *((volatile unsigned int*)(0x42CF046CUL))
#define bFM3_ETHERNET_MAC1_MAR20H_MBC4         *((volatile unsigned int*)(0x42CF0470UL))
#define bFM3_ETHERNET_MAC1_MAR20H_MBC5         *((volatile unsigned int*)(0x42CF0474UL))
#define bFM3_ETHERNET_MAC1_MAR20H_SA           *((volatile unsigned int*)(0x42CF0478UL))
#define bFM3_ETHERNET_MAC1_MAR20H_AE           *((volatile unsigned int*)(0x42CF047CUL))
#define bFM3_ETHERNET_MAC1_MAR20L_A0           *((volatile unsigned int*)(0x42CF0480UL))
#define bFM3_ETHERNET_MAC1_MAR20L_A1           *((volatile unsigned int*)(0x42CF0484UL))
#define bFM3_ETHERNET_MAC1_MAR20L_A2           *((volatile unsigned int*)(0x42CF0488UL))
#define bFM3_ETHERNET_MAC1_MAR20L_A3           *((volatile unsigned int*)(0x42CF048CUL))
#define bFM3_ETHERNET_MAC1_MAR20L_A4           *((volatile unsigned int*)(0x42CF0490UL))
#define bFM3_ETHERNET_MAC1_MAR20L_A5           *((volatile unsigned int*)(0x42CF0494UL))
#define bFM3_ETHERNET_MAC1_MAR20L_A6           *((volatile unsigned int*)(0x42CF0498UL))
#define bFM3_ETHERNET_MAC1_MAR20L_A7           *((volatile unsigned int*)(0x42CF049CUL))
#define bFM3_ETHERNET_MAC1_MAR20L_A8           *((volatile unsigned int*)(0x42CF04A0UL))
#define bFM3_ETHERNET_MAC1_MAR20L_A9           *((volatile unsigned int*)(0x42CF04A4UL))
#define bFM3_ETHERNET_MAC1_MAR20L_A10          *((volatile unsigned int*)(0x42CF04A8UL))
#define bFM3_ETHERNET_MAC1_MAR20L_A11          *((volatile unsigned int*)(0x42CF04ACUL))
#define bFM3_ETHERNET_MAC1_MAR20L_A12          *((volatile unsigned int*)(0x42CF04B0UL))
#define bFM3_ETHERNET_MAC1_MAR20L_A13          *((volatile unsigned int*)(0x42CF04B4UL))
#define bFM3_ETHERNET_MAC1_MAR20L_A14          *((volatile unsigned int*)(0x42CF04B8UL))
#define bFM3_ETHERNET_MAC1_MAR20L_A15          *((volatile unsigned int*)(0x42CF04BCUL))
#define bFM3_ETHERNET_MAC1_MAR20L_A16          *((volatile unsigned int*)(0x42CF04C0UL))
#define bFM3_ETHERNET_MAC1_MAR20L_A17          *((volatile unsigned int*)(0x42CF04C4UL))
#define bFM3_ETHERNET_MAC1_MAR20L_A18          *((volatile unsigned int*)(0x42CF04C8UL))
#define bFM3_ETHERNET_MAC1_MAR20L_A19          *((volatile unsigned int*)(0x42CF04CCUL))
#define bFM3_ETHERNET_MAC1_MAR20L_A20          *((volatile unsigned int*)(0x42CF04D0UL))
#define bFM3_ETHERNET_MAC1_MAR20L_A21          *((volatile unsigned int*)(0x42CF04D4UL))
#define bFM3_ETHERNET_MAC1_MAR20L_A22          *((volatile unsigned int*)(0x42CF04D8UL))
#define bFM3_ETHERNET_MAC1_MAR20L_A23          *((volatile unsigned int*)(0x42CF04DCUL))
#define bFM3_ETHERNET_MAC1_MAR20L_A24          *((volatile unsigned int*)(0x42CF04E0UL))
#define bFM3_ETHERNET_MAC1_MAR20L_A25          *((volatile unsigned int*)(0x42CF04E4UL))
#define bFM3_ETHERNET_MAC1_MAR20L_A26          *((volatile unsigned int*)(0x42CF04E8UL))
#define bFM3_ETHERNET_MAC1_MAR20L_A27          *((volatile unsigned int*)(0x42CF04ECUL))
#define bFM3_ETHERNET_MAC1_MAR20L_A28          *((volatile unsigned int*)(0x42CF04F0UL))
#define bFM3_ETHERNET_MAC1_MAR20L_A29          *((volatile unsigned int*)(0x42CF04F4UL))
#define bFM3_ETHERNET_MAC1_MAR20L_A30          *((volatile unsigned int*)(0x42CF04F8UL))
#define bFM3_ETHERNET_MAC1_MAR20L_A31          *((volatile unsigned int*)(0x42CF04FCUL))
#define bFM3_ETHERNET_MAC1_MAR21H_A32          *((volatile unsigned int*)(0x42CF0500UL))
#define bFM3_ETHERNET_MAC1_MAR21H_A33          *((volatile unsigned int*)(0x42CF0504UL))
#define bFM3_ETHERNET_MAC1_MAR21H_A34          *((volatile unsigned int*)(0x42CF0508UL))
#define bFM3_ETHERNET_MAC1_MAR21H_A35          *((volatile unsigned int*)(0x42CF050CUL))
#define bFM3_ETHERNET_MAC1_MAR21H_A36          *((volatile unsigned int*)(0x42CF0510UL))
#define bFM3_ETHERNET_MAC1_MAR21H_A37          *((volatile unsigned int*)(0x42CF0514UL))
#define bFM3_ETHERNET_MAC1_MAR21H_A38          *((volatile unsigned int*)(0x42CF0518UL))
#define bFM3_ETHERNET_MAC1_MAR21H_A39          *((volatile unsigned int*)(0x42CF051CUL))
#define bFM3_ETHERNET_MAC1_MAR21H_A40          *((volatile unsigned int*)(0x42CF0520UL))
#define bFM3_ETHERNET_MAC1_MAR21H_A41          *((volatile unsigned int*)(0x42CF0524UL))
#define bFM3_ETHERNET_MAC1_MAR21H_A42          *((volatile unsigned int*)(0x42CF0528UL))
#define bFM3_ETHERNET_MAC1_MAR21H_A43          *((volatile unsigned int*)(0x42CF052CUL))
#define bFM3_ETHERNET_MAC1_MAR21H_A44          *((volatile unsigned int*)(0x42CF0530UL))
#define bFM3_ETHERNET_MAC1_MAR21H_A45          *((volatile unsigned int*)(0x42CF0534UL))
#define bFM3_ETHERNET_MAC1_MAR21H_A46          *((volatile unsigned int*)(0x42CF0538UL))
#define bFM3_ETHERNET_MAC1_MAR21H_A47          *((volatile unsigned int*)(0x42CF053CUL))
#define bFM3_ETHERNET_MAC1_MAR21H_MBC0         *((volatile unsigned int*)(0x42CF0560UL))
#define bFM3_ETHERNET_MAC1_MAR21H_MBC1         *((volatile unsigned int*)(0x42CF0564UL))
#define bFM3_ETHERNET_MAC1_MAR21H_MBC2         *((volatile unsigned int*)(0x42CF0568UL))
#define bFM3_ETHERNET_MAC1_MAR21H_MBC3         *((volatile unsigned int*)(0x42CF056CUL))
#define bFM3_ETHERNET_MAC1_MAR21H_MBC4         *((volatile unsigned int*)(0x42CF0570UL))
#define bFM3_ETHERNET_MAC1_MAR21H_MBC5         *((volatile unsigned int*)(0x42CF0574UL))
#define bFM3_ETHERNET_MAC1_MAR21H_SA           *((volatile unsigned int*)(0x42CF0578UL))
#define bFM3_ETHERNET_MAC1_MAR21H_AE           *((volatile unsigned int*)(0x42CF057CUL))
#define bFM3_ETHERNET_MAC1_MAR21L_A0           *((volatile unsigned int*)(0x42CF0580UL))
#define bFM3_ETHERNET_MAC1_MAR21L_A1           *((volatile unsigned int*)(0x42CF0584UL))
#define bFM3_ETHERNET_MAC1_MAR21L_A2           *((volatile unsigned int*)(0x42CF0588UL))
#define bFM3_ETHERNET_MAC1_MAR21L_A3           *((volatile unsigned int*)(0x42CF058CUL))
#define bFM3_ETHERNET_MAC1_MAR21L_A4           *((volatile unsigned int*)(0x42CF0590UL))
#define bFM3_ETHERNET_MAC1_MAR21L_A5           *((volatile unsigned int*)(0x42CF0594UL))
#define bFM3_ETHERNET_MAC1_MAR21L_A6           *((volatile unsigned int*)(0x42CF0598UL))
#define bFM3_ETHERNET_MAC1_MAR21L_A7           *((volatile unsigned int*)(0x42CF059CUL))
#define bFM3_ETHERNET_MAC1_MAR21L_A8           *((volatile unsigned int*)(0x42CF05A0UL))
#define bFM3_ETHERNET_MAC1_MAR21L_A9           *((volatile unsigned int*)(0x42CF05A4UL))
#define bFM3_ETHERNET_MAC1_MAR21L_A10          *((volatile unsigned int*)(0x42CF05A8UL))
#define bFM3_ETHERNET_MAC1_MAR21L_A11          *((volatile unsigned int*)(0x42CF05ACUL))
#define bFM3_ETHERNET_MAC1_MAR21L_A12          *((volatile unsigned int*)(0x42CF05B0UL))
#define bFM3_ETHERNET_MAC1_MAR21L_A13          *((volatile unsigned int*)(0x42CF05B4UL))
#define bFM3_ETHERNET_MAC1_MAR21L_A14          *((volatile unsigned int*)(0x42CF05B8UL))
#define bFM3_ETHERNET_MAC1_MAR21L_A15          *((volatile unsigned int*)(0x42CF05BCUL))
#define bFM3_ETHERNET_MAC1_MAR21L_A16          *((volatile unsigned int*)(0x42CF05C0UL))
#define bFM3_ETHERNET_MAC1_MAR21L_A17          *((volatile unsigned int*)(0x42CF05C4UL))
#define bFM3_ETHERNET_MAC1_MAR21L_A18          *((volatile unsigned int*)(0x42CF05C8UL))
#define bFM3_ETHERNET_MAC1_MAR21L_A19          *((volatile unsigned int*)(0x42CF05CCUL))
#define bFM3_ETHERNET_MAC1_MAR21L_A20          *((volatile unsigned int*)(0x42CF05D0UL))
#define bFM3_ETHERNET_MAC1_MAR21L_A21          *((volatile unsigned int*)(0x42CF05D4UL))
#define bFM3_ETHERNET_MAC1_MAR21L_A22          *((volatile unsigned int*)(0x42CF05D8UL))
#define bFM3_ETHERNET_MAC1_MAR21L_A23          *((volatile unsigned int*)(0x42CF05DCUL))
#define bFM3_ETHERNET_MAC1_MAR21L_A24          *((volatile unsigned int*)(0x42CF05E0UL))
#define bFM3_ETHERNET_MAC1_MAR21L_A25          *((volatile unsigned int*)(0x42CF05E4UL))
#define bFM3_ETHERNET_MAC1_MAR21L_A26          *((volatile unsigned int*)(0x42CF05E8UL))
#define bFM3_ETHERNET_MAC1_MAR21L_A27          *((volatile unsigned int*)(0x42CF05ECUL))
#define bFM3_ETHERNET_MAC1_MAR21L_A28          *((volatile unsigned int*)(0x42CF05F0UL))
#define bFM3_ETHERNET_MAC1_MAR21L_A29          *((volatile unsigned int*)(0x42CF05F4UL))
#define bFM3_ETHERNET_MAC1_MAR21L_A30          *((volatile unsigned int*)(0x42CF05F8UL))
#define bFM3_ETHERNET_MAC1_MAR21L_A31          *((volatile unsigned int*)(0x42CF05FCUL))
#define bFM3_ETHERNET_MAC1_MAR22H_A32          *((volatile unsigned int*)(0x42CF0600UL))
#define bFM3_ETHERNET_MAC1_MAR22H_A33          *((volatile unsigned int*)(0x42CF0604UL))
#define bFM3_ETHERNET_MAC1_MAR22H_A34          *((volatile unsigned int*)(0x42CF0608UL))
#define bFM3_ETHERNET_MAC1_MAR22H_A35          *((volatile unsigned int*)(0x42CF060CUL))
#define bFM3_ETHERNET_MAC1_MAR22H_A36          *((volatile unsigned int*)(0x42CF0610UL))
#define bFM3_ETHERNET_MAC1_MAR22H_A37          *((volatile unsigned int*)(0x42CF0614UL))
#define bFM3_ETHERNET_MAC1_MAR22H_A38          *((volatile unsigned int*)(0x42CF0618UL))
#define bFM3_ETHERNET_MAC1_MAR22H_A39          *((volatile unsigned int*)(0x42CF061CUL))
#define bFM3_ETHERNET_MAC1_MAR22H_A40          *((volatile unsigned int*)(0x42CF0620UL))
#define bFM3_ETHERNET_MAC1_MAR22H_A41          *((volatile unsigned int*)(0x42CF0624UL))
#define bFM3_ETHERNET_MAC1_MAR22H_A42          *((volatile unsigned int*)(0x42CF0628UL))
#define bFM3_ETHERNET_MAC1_MAR22H_A43          *((volatile unsigned int*)(0x42CF062CUL))
#define bFM3_ETHERNET_MAC1_MAR22H_A44          *((volatile unsigned int*)(0x42CF0630UL))
#define bFM3_ETHERNET_MAC1_MAR22H_A45          *((volatile unsigned int*)(0x42CF0634UL))
#define bFM3_ETHERNET_MAC1_MAR22H_A46          *((volatile unsigned int*)(0x42CF0638UL))
#define bFM3_ETHERNET_MAC1_MAR22H_A47          *((volatile unsigned int*)(0x42CF063CUL))
#define bFM3_ETHERNET_MAC1_MAR22H_MBC0         *((volatile unsigned int*)(0x42CF0660UL))
#define bFM3_ETHERNET_MAC1_MAR22H_MBC1         *((volatile unsigned int*)(0x42CF0664UL))
#define bFM3_ETHERNET_MAC1_MAR22H_MBC2         *((volatile unsigned int*)(0x42CF0668UL))
#define bFM3_ETHERNET_MAC1_MAR22H_MBC3         *((volatile unsigned int*)(0x42CF066CUL))
#define bFM3_ETHERNET_MAC1_MAR22H_MBC4         *((volatile unsigned int*)(0x42CF0670UL))
#define bFM3_ETHERNET_MAC1_MAR22H_MBC5         *((volatile unsigned int*)(0x42CF0674UL))
#define bFM3_ETHERNET_MAC1_MAR22H_SA           *((volatile unsigned int*)(0x42CF0678UL))
#define bFM3_ETHERNET_MAC1_MAR22H_AE           *((volatile unsigned int*)(0x42CF067CUL))
#define bFM3_ETHERNET_MAC1_MAR22L_A0           *((volatile unsigned int*)(0x42CF0680UL))
#define bFM3_ETHERNET_MAC1_MAR22L_A1           *((volatile unsigned int*)(0x42CF0684UL))
#define bFM3_ETHERNET_MAC1_MAR22L_A2           *((volatile unsigned int*)(0x42CF0688UL))
#define bFM3_ETHERNET_MAC1_MAR22L_A3           *((volatile unsigned int*)(0x42CF068CUL))
#define bFM3_ETHERNET_MAC1_MAR22L_A4           *((volatile unsigned int*)(0x42CF0690UL))
#define bFM3_ETHERNET_MAC1_MAR22L_A5           *((volatile unsigned int*)(0x42CF0694UL))
#define bFM3_ETHERNET_MAC1_MAR22L_A6           *((volatile unsigned int*)(0x42CF0698UL))
#define bFM3_ETHERNET_MAC1_MAR22L_A7           *((volatile unsigned int*)(0x42CF069CUL))
#define bFM3_ETHERNET_MAC1_MAR22L_A8           *((volatile unsigned int*)(0x42CF06A0UL))
#define bFM3_ETHERNET_MAC1_MAR22L_A9           *((volatile unsigned int*)(0x42CF06A4UL))
#define bFM3_ETHERNET_MAC1_MAR22L_A10          *((volatile unsigned int*)(0x42CF06A8UL))
#define bFM3_ETHERNET_MAC1_MAR22L_A11          *((volatile unsigned int*)(0x42CF06ACUL))
#define bFM3_ETHERNET_MAC1_MAR22L_A12          *((volatile unsigned int*)(0x42CF06B0UL))
#define bFM3_ETHERNET_MAC1_MAR22L_A13          *((volatile unsigned int*)(0x42CF06B4UL))
#define bFM3_ETHERNET_MAC1_MAR22L_A14          *((volatile unsigned int*)(0x42CF06B8UL))
#define bFM3_ETHERNET_MAC1_MAR22L_A15          *((volatile unsigned int*)(0x42CF06BCUL))
#define bFM3_ETHERNET_MAC1_MAR22L_A16          *((volatile unsigned int*)(0x42CF06C0UL))
#define bFM3_ETHERNET_MAC1_MAR22L_A17          *((volatile unsigned int*)(0x42CF06C4UL))
#define bFM3_ETHERNET_MAC1_MAR22L_A18          *((volatile unsigned int*)(0x42CF06C8UL))
#define bFM3_ETHERNET_MAC1_MAR22L_A19          *((volatile unsigned int*)(0x42CF06CCUL))
#define bFM3_ETHERNET_MAC1_MAR22L_A20          *((volatile unsigned int*)(0x42CF06D0UL))
#define bFM3_ETHERNET_MAC1_MAR22L_A21          *((volatile unsigned int*)(0x42CF06D4UL))
#define bFM3_ETHERNET_MAC1_MAR22L_A22          *((volatile unsigned int*)(0x42CF06D8UL))
#define bFM3_ETHERNET_MAC1_MAR22L_A23          *((volatile unsigned int*)(0x42CF06DCUL))
#define bFM3_ETHERNET_MAC1_MAR22L_A24          *((volatile unsigned int*)(0x42CF06E0UL))
#define bFM3_ETHERNET_MAC1_MAR22L_A25          *((volatile unsigned int*)(0x42CF06E4UL))
#define bFM3_ETHERNET_MAC1_MAR22L_A26          *((volatile unsigned int*)(0x42CF06E8UL))
#define bFM3_ETHERNET_MAC1_MAR22L_A27          *((volatile unsigned int*)(0x42CF06ECUL))
#define bFM3_ETHERNET_MAC1_MAR22L_A28          *((volatile unsigned int*)(0x42CF06F0UL))
#define bFM3_ETHERNET_MAC1_MAR22L_A29          *((volatile unsigned int*)(0x42CF06F4UL))
#define bFM3_ETHERNET_MAC1_MAR22L_A30          *((volatile unsigned int*)(0x42CF06F8UL))
#define bFM3_ETHERNET_MAC1_MAR22L_A31          *((volatile unsigned int*)(0x42CF06FCUL))
